swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
/**************************************************************************//**
 * @file     rtl8735b_uart.c
 * @brief    This file implements the UART IP power, clock, baud rate
 *           configuration functions.
 * @version  V1.00
 * @date     2021-06-29
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2019 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include "rtl8735b_uart_type_unify.h"
#include "rtl8735b.h"

#if CONFIG_UART_EN

#if !defined(CONFIG_BUILD_NONSECURE)
#undef UART0_REG_BASE
#define UART0_REG_BASE (UART0_S_BASE)
#undef UART1_REG_BASE
#define UART1_REG_BASE (UART1_S_BASE)
#undef UART2_REG_BASE
#define UART2_REG_BASE (UART2_S_BASE)
#undef UART3_REG_BASE
#define UART3_REG_BASE (UART3_S_BASE)
#undef UART4_REG_BASE
#define UART4_REG_BASE (UART4_S_BASE)
#else

#undef UART0_REG_BASE
#define UART0_REG_BASE (UART0_BASE)
#undef UART1_REG_BASE
#define UART1_REG_BASE (UART1_BASE)
#undef UART2_REG_BASE
#define UART2_REG_BASE (UART2_BASE)
#undef UART3_REG_BASE
#define UART3_REG_BASE (UART3_BASE)
#undef UART4_REG_BASE
#define UART4_REG_BASE (UART4_BASE)
#endif


#define SECTION_UART_TEXT           SECTION(".rom.hal_uart.text")
#define SECTION_UART_DATA           SECTION(".rom.hal_uart.data")
#define SECTION_UART_RODATA         SECTION(".rom.hal_uart.rodata")
#define SECTION_UART_BSS            SECTION(".rom.hal_uart.bss")
#define SECTION_UART_STUBS          SECTION(".rom.hal_uart.stubs")

extern void *_memset(void *dst0, int Val, SIZE_T length);

void _uart_irq_handler(phal_uart_adapter_t puart_adapter);
void _uart_tx_dma_irq_handler(phal_uart_adapter_t puart_adapter);
void _uart_rx_dma_irq_handler(phal_uart_adapter_t puart_adapter);
void uart_tx_isr(phal_uart_adapter_t puart_adapter);
void uart_rx_isr(phal_uart_adapter_t puart_adapter);
void uart_iir_isr(phal_uart_adapter_t puart_adapter);

/**
  * @brief Baud rate table. List out the pre-defined supported baud rate.
  *        If the baud rate setting is not list in this table, the divisor
  *        value is caculated at run time.
  */
SECTION_UART_RODATA const uint32_t def_baudrate_table[] = {
	110,     300,     600,    1200,
	2400,    4800,    9600,   14400,
	19200,   28800,   38400,   57600,
	76800,  115200,  128000,  153600,
	230400,  380400,  460800,  500000,
	921600, 1000000, 1382400, 1444400,
	1500000, 1843200, 2000000, 2100000,
	2764800, 3000000, 3250000, 3692300,
	3750000, 4000000, 6000000,

	// End of the table
	0xffffffff
};

/**
  * @brief Over sampling table. The over sampling value for pre-defined
  *        baud rate. It is base on the UART0 SCLK = 4M.
  */
SECTION_UART_RODATA const uint8_t def_ovsr_4m[] = {
	20, 17, 17, 17,
	17, 17, 13, 12,
	13, 17, 13, 17,
	13, 17, 10, 13,
	17,  5,  8,  8,
	4,  4,  2,  2,
	2,  2,  2,  1,
	1,  1,  1,  1,
	1,  1,  0
};

/**
  * @brief Divisor table. The divisor value for pre-defined
  *        baud rate. It is base on the UART0 SCLK = 4M.
  */
SECTION_UART_RODATA const uint16_t def_div_4m[] = {
	1818,    784,    392,    196,
	98,     49,     32,     23,
	16,      8,      8,      4,
	4,      2,      3,      2,
	1,      2,      1,      1,
	1,      1,      1,      1,
	1,      1,      1,      1,
	1,      1,      1,      1,
	1,      1,      1
};

/**
  * @brief Bit adjustment table index for 10-bits frame.
  *             It is base on the UART0 SCLK = 4M.
  */
SECTION_UART_RODATA const uint8_t def_ovsr_adj_bit_10b_4m[] = {
	0,   0,   0,   0,
	0,   0,   0,   1,
	0,   4,   0,   4,
	0,   4,   4,   0,
	4,   2,   7,   0,
	3,   0,   9,   8,
	7,   2,   0,   9,
	4,   3,   2,   1,
	1,   0,   7
};

/**
  * @brief Bit adjustment table index for 9-bits frame.
  *             It is base on the UART0 SCLK = 4M.
  */
SECTION_UART_RODATA const uint8_t def_ovsr_adj_bit_9b_4m[] = {
	0,   0,   0,   0,
	0,   0,   0,   1,
	0,   3,   0,   3,
	0,   3,   4,   0,
	3,   2,   6,   0,
	3,   0,   8,   7,
	6,   1,   0,   8,
	4,   3,   2,   1,
	1,   0,   6
};

/**
  * @brief Bit adjustment table index for 8-bits frame.
  *             It is base on the UART0 SCLK = 4M.
  */
SECTION_UART_RODATA const uint8_t def_ovsr_adj_bit_8b_4m[] = {
	0,   0,   0,   0,
	0,   0,   0,   1,
	0,   3,   0,   3,
	0,   3,   3,   0,
	3,   2,   5,   0,
	3,   0,   7,   6,
	5,   1,   0,   7,
	3,   3,   2,   1,
	0,   0,   5
};

/**
  * @brief Over sampling table. The over sampling value for pre-defined
  *        baud rate. It is base on the UART SCLK = 26M.
  */
SECTION_UART_RODATA const uint8_t def_ovsr_26m[] = {
	20, 20, 20, 20,
	19, 19, 11, 19,
	11, 11, 13, 11,
	13, 15, 10, 13,
	14, 17, 14, 13,
	14, 13,  9, 18,
	17,  7, 13,  6,
	9,  8,  8,  7,
	6,  6,  4
};

/**
  * @brief Divisor table. The divisor value for pre-defined
  *        baud rate. It is base on the UART SCLK = 26M.
  */
SECTION_UART_RODATA const uint16_t def_div_26m[] = {
	11813,  4332,  2166,  1083,
	570,   285,   246,    95,
	123,    82,    52,    41,
	26,    15,    20,    13,
	8,     4,     4,     4,
	2,     2,     2,     1,
	1,     2,     1,     2,
	1,     1,     1,     1,
	1,     1,     1
};

/**
  * @brief Bit adjustment table index for 10-bits frame.
  *             It is base on the UART0 SCLK = 26M.
  */
SECTION_UART_RODATA const uint8_t def_ovsr_adj_bit_10b_26m[] = {
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   1,   0,   0,
	0,   0,   0,   2,
	1,   0,   3,   7,
	0,   3,   3,   4,
	3,   2,   3
};

/**
  * @brief Bit adjustment table index for 9-bits frame.
  *             It is base on the UART0 SCLK = 26M.
  */
SECTION_UART_RODATA const uint8_t def_ovsr_adj_bit_9b_26m[] = {
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   1,   0,   0,
	0,   0,   0,   3,
	1,   0,   3,   8,
	0,   3,   3,   5,
	3,   2,   3
};

/**
  * @brief Bit adjustment table index for 8-bits frame.
  *             It is base on the UART0 SCLK = 26M.
  */
SECTION_UART_RODATA const uint8_t def_ovsr_adj_bit_8b_26m[] = {
	0,  0,  0,  0,
	0,  0,  0,  0,
	0,  0,  0,  0,
	0,  1,  0,  0,
	2,  0,  3,  0,
	4,  0,  4,  2,
	3,  2,  0,  0,
	2,  3,  1,  3,
	3,  0,  5
};


/**
  * @brief Over sampling table. The over sampling value for pre-defined
  *        baud rate. It is base on the UART0 SCLK = 40M.
  */
SECTION_UART_RODATA const uint8_t def_ovsr_40m[] = {
	20, 20, 20, 20,
	20, 17, 17, 15,
	10, 11, 10, 11,
	10, 15, 12, 10,
	10, 15, 17, 20,
	14, 20, 14,  9,
	13,  7, 20, 19,
	7, 13,  6,  5,
	5, 10,  6
};

/**
  * @brief Divisor table. The divisor value for pre-defined
  *        baud rate. It is base on the UART0 SCLK = 40M.
  */
SECTION_UART_RODATA const uint16_t def_div_40m[] = {
	18173,  6664,  3332,  1666,
	833,   490,   245,   185,
	208,   126,   104,    63,
	52,    23,    26,    26,
	17,     7,     5,     4,
	3,     2,     2,     3,
	2,     3,     1,     1,
	2,     1,     2,     2,
	2,     1,     1
};

/**
  * @brief Bit adjustment table index for 10-bits frame.
  *             It is base on the UART0 SCLK = 40M
  */
SECTION_UART_RODATA const uint8_t def_ovsr_adj_bit_10b_40m[] = {
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   1,   0,   0,
	2,   0,   4,   0,
	5,   0,   5,   2,
	3,   2,   0,   0,
	2,   3,   1,   4,
	3,   0,   7
};

/**
  * @brief Bit adjustment table index for 9-bits frame.
  *             It is base on the UART0 SCLK = 40M
  */
SECTION_UART_RODATA const uint8_t def_ovsr_adj_bit_9b_40m[] = {
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   1,   0,   0,
	2,   0,   3,   0,
	4,   0,   4,   2,
	3,   2,   0,   0,
	2,   3,   1,   4,
	3,   0,   6
};

/**
  * @brief Bit adjustment table index for 8-bits frame.
  *             It is base on the UART0 SCLK = 40M
  */
SECTION_UART_RODATA const uint8_t def_ovsr_adj_bit_8b_40m[] = {
	0,  0,  0,  0,
	0,  0,  0,  0,
	0,  0,  0,  0,
	0,  1,  0,  0,
	2,  0,  3,  0,
	4,  0,  4,  2,
	3,  2,  0,  0,
	2,  3,  1,  3,
	3,  0,  5
};


/**
  * @brief Over sampling table. The over sampling value for pre-defined
  *        baud rate. It is base on the UART1/2/3/4 SCLK = 50M.
  */
SECTION_UART_RODATA const uint8_t def_ovsr_50m[] = {
	20, 20, 20, 20,
	19, 19, 19, 16,
	19, 14, 14, 14,
	10, 14, 10, 13,
	12, 10, 12, 20,
	9, 10,  9, 17,
	11,  9,  8, 11,
	9,  8, 15, 13,
	13,  6,  8
};

/**
  * @brief Divisor table. The divisor value for pre-defined
  *        baud rate. It is base on the UART1/2/3/4 SCLK = 50M.
  */
SECTION_UART_RODATA const uint16_t def_div_50m[] = {
	22716,  8330,  4165,  2083,
	1096,   548,   274,   217,
	137,   124,    93,    62,
	65,    31,    39,    25,
	18,    13,     9,     5,
	6,     5,     4,     2,
	3,     3,     3,     2,
	2,     2,     1,     1,
	1,     2,     1
};

/**
  * @brief Bit adjustment table index for 10-bits frame.
  *             It is base on the UART1/2/3/4 SCLK = 50M.
  */
SECTION_UART_RODATA const uint8_t def_ovsr_adj_bit_10b_50m[] = {
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   1,   0,   0,
	0,   0,   0,   2,
	1,   0,   3,   7,
	0,   3,   3,   4,
	3,   2,   3
};

/**
  * @brief Bit adjustment table index for 9-bits frame.
  *             It is base on the UART1/2/3/4 SCLK = 50M.
  */
SECTION_UART_RODATA const uint8_t def_ovsr_adj_bit_9b_50m[] = {
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   0,   0,   0,
	0,   1,   0,   0,
	0,   0,   0,   3,
	1,   0,   3,   8,
	0,   3,   3,   5,
	3,   2,   3
};

/**
  * @brief Bit adjustment table index for 8-bits frame.
  *             It is base on the UART1/2/3/4 SCLK = 50M.
  */
SECTION_UART_RODATA const uint8_t def_ovsr_adj_bit_8b_50m[] = {
	0,  0,  0,  0,
	0,  0,  0,  0,
	0,  0,  0,  0,
	0,  1,  0,  0,
	2,  0,  3,  0,
	4,  0,  4,  2,
	3,  2,  0,  0,
	2,  3,  1,  3,
	3,  0,  5
};


/**
  * @brief Bit adjustment table for 10-bits frame.
  */
SECTION_UART_RODATA const uint16_t ovsr_adj_table_10bit[10] = {
	0x000, 0x020, 0x044, 0x124, 0x294, 0x2AA, 0x16B, 0x2DB, 0x3BB, 0x3EF
};

/**
  * @brief Bit adjustment table for 9-bits frame.
  */
SECTION_UART_RODATA const uint16_t ovsr_adj_table_9bit[9] = {
	0x000, 0x010, 0x044, 0x92, 0xAA, 0x155, 0x1B6, 0x1BB, 0x1EF
};

/**
  * @brief Bit adjustment table for 8-bits frame.
  */
SECTION_UART_RODATA const uint16_t ovsr_adj_table_8bit[8] = {
	0x000, 0x010, 0x044, 0x92, 0xAA, 0xB5, 0xBB, 0xEF
};

/**
  * @brief Pin map of UART RX pin.
  */
SECTION_UART_RODATA const hal_pin_map uart_rx_pin_map[] = {
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	{PIN_A3,  PID_UART0},
	{PIN_F4,  PID_UART1},
	{PIN_F12, PID_UART1},
	{PIN_D16, PID_UART2},
	{PIN_E2,  PID_UART2},
	{PIN_E6,  PID_UART3},

