swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
	{PIN_UART4_RX, PID_UART4},

	{0xFF,    0xFF} // end of table
#else
	{PIN_A3,  PID_UART0},
	{PIN_F3,  PID_UART1},
	{PIN_F12, PID_UART1},
	{PIN_D16, PID_UART2},
	{PIN_D20, PID_UART2},
	{PIN_D16, PID_UART2},
	{PIN_E2,  PID_UART3},

	{PIN_UART4_RX, PID_UART4},

	{0xFF,    0xFF} // end of table
#endif
};

/**
  * @brief Pin map of UART TX pin.
  */
SECTION_UART_RODATA const hal_pin_map uart_tx_pin_map[] = {
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	{PIN_A2,  PID_UART0},
	{PIN_F5,  PID_UART1},
	{PIN_F13, PID_UART1},
	{PIN_D15, PID_UART2},
	{PIN_E1,  PID_UART2},
	{PIN_E5,  PID_UART3},

	{PIN_UART4_TX, PID_UART4},

	{0xFF,    0xFF} // end of table
#else
	{PIN_A2,  PID_UART0},
	{PIN_F4,  PID_UART1},
	{PIN_F13, PID_UART1},
	{PIN_D15, PID_UART2},
	{PIN_D19, PID_UART2},
	{PIN_E0,  PID_UART2},
	{PIN_E1,  PID_UART3},

	{PIN_UART4_TX, PID_UART4},

	{0xFF,    0xFF} // end of table
#endif
};

/**
  * @brief Pin map of UART RTS pin.
  */
SECTION_UART_RODATA const hal_pin_map uart_rts_pin_map[] = {
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	{PIN_NC,  PID_UART0},//UART0 NONE
	{PIN_F3,  PID_UART1},
	{PIN_E4,  PID_UART2},
	{PIN_E7,  PID_UART3},

	{PIN_UART4_RTS, PID_UART4},

	{0xFF,    0xFF} // end of table
#else
	{PIN_NC,  PID_UART0},//UART0 NONE
	{PIN_F2,  PID_UART1},
	{PIN_D18, PID_UART2},
	{PIN_E3,  PID_UART3},

	{PIN_UART4_RTS, PID_UART4},

	{0xFF,    0xFF} // end of table
#endif
};

/**
  * @brief Pin map of UART CTS pin.
  */
SECTION_UART_RODATA const hal_pin_map uart_cts_pin_map[] = {
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	{PIN_NC,  PID_UART0},//UART0 NONE
	{PIN_F2,  PID_UART1},
	{PIN_E3,  PID_UART2},
	{PIN_E8,  PID_UART3},

	{PIN_UART4_CTS, PID_UART4},

	{0xFF,    0xFF} // end of table
#else
	{PIN_NC,  PID_UART0},//UART0 NONE
	{PIN_F1,  PID_UART1},
	{PIN_D17, PID_UART2},
	{PIN_E4,  PID_UART3},

	{PIN_UART4_CTS, PID_UART4},

	{0xFF,    0xFF} // end of table
#endif
};

/**
  * @brief RTS pin list for each UART index.
  */
SECTION_UART_RODATA const uint32_t uart_rts_pin_tbl[] = {
	PIN_NC,         // RTS pin of UART0
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	PIN_F3,         // RTS pin of UART1
	PIN_E4,         // RTS pin of UART2
	PIN_E7,         // RTS pin of UART3
#else
	PIN_F2,         // RTS pin of UART1
	PIN_D18,        // RTS pin of UART2
	PIN_E3,         // RTS pin of UART3
#endif
	PIN_UART4_RTS   // RTS pin of UART4
};

/**
  * @brief CTS pin list for each UART index.
  */
SECTION_UART_RODATA const uint32_t uart_cts_pin_tbl[] = {
	PIN_NC,         // CTS pin of UART0
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	PIN_F2,         // CTS pin of UART1
	PIN_E3,         // CTS pin of UART2
	PIN_E8,         // CTS pin of UART3
#else
	PIN_F1,         // CTS pin of UART1
	PIN_D17,        // CTS pin of UART2
	PIN_E4,         // CTS pin of UART3
#endif
	PIN_UART4_CTS   // RTS pin of UART4
};

/**
  * @brief GDMA handshake interface ID for UART TX.
  */
SECTION_UART_RODATA const uint8_t uart_tx_gdma_hsk_id_tbl[] = {
	GDMA_HANDSHAKE_UART0_TX,        // GDMA hardware handshake number for UART0 TX
	GDMA_HANDSHAKE_UART1_TX,        // GDMA hardware handshake number for UART1 TX
	GDMA_HANDSHAKE_UART2_TX,        // GDMA hardware handshake number for UART2 TX
	GDMA_HANDSHAKE_UART3_TX,        // GDMA hardware handshake number for UART3 TX
	GDMA_HANDSHAKE_BT_UART_TX       // GDMA hardware handshake number for UART4 TX
};

/**
  * @brief GDMA handshake interface ID for UART RX.
  */
SECTION_UART_RODATA const uint8_t uart_rx_gdma_hsk_id_tbl[] = {
	GDMA_HANDSHAKE_UART0_RX,        // GDMA hardware handshake number for UART0 RX
	GDMA_HANDSHAKE_UART1_RX,        // GDMA hardware handshake number for UART1 RX
	GDMA_HANDSHAKE_UART2_RX,        // GDMA hardware handshake number for UART2 RX
	GDMA_HANDSHAKE_UART3_RX,        // GDMA hardware handshake number for UART3 RX
	GDMA_HANDSHAKE_BT_UART_RX       // GDMA hardware handshake number for UART4 RX
};

/**
  * @brief The default UART adapter setting. This structure can be used to initial a new
  *        UART adapter for UART0.
  */
SECTION_UART_RODATA const hal_uart_defconfig_t hal_uart_default_setting_40m = {
	.baudrate = 115200,                 /*!< the baud rate: 115200  */
	.flow_ctrl = UartFlowCtlNone,       /*!< flow control setting */
	.word_len = 8,                      /*!< frame length: 8 bits */
	.stop_bit = 1,                      /*!< stop bit: 1 stop bit */
	.parity_type = UartParityNone,      /*!< parity check: none  */
	.pdef_baudrate_tbl = def_baudrate_table,            /*!< the pre-defined support baud rate table */
	.pdef_ovsr_tbl = def_ovsr_40m,                      /*!< OVSR table for pre-defined baud rate */
	.pdef_div_tbl = def_div_40m,                        /*!< the table of DIV for pre-defined baud rate */
	.pdef_ovsradjbit_tbl10 = def_ovsr_adj_bit_10b_40m,  /*!< the table of OVSR-Adj bits for 10 bits frame */
	.pdef_ovsradjbit_tbl9 = def_ovsr_adj_bit_9b_40m,    /*!< the table of OVSR-Adj bits for 9 bits frame */
	.pdef_ovsradjbit_tbl8 = def_ovsr_adj_bit_8b_40m,    /*!< the table of OVSR-Adj bits for 8 bits frame */
	.pdef_ovsradj_tbl10 = ovsr_adj_table_10bit,         /*!< the table of OVSR-Adj for for 10 bits frame */
	.pdef_ovsradj_tbl9 = ovsr_adj_table_9bit,           /*!< the table of OVSR-Adj for for 9 bits frame */
	.pdef_ovsradj_tbl8 = ovsr_adj_table_8bit            /*!< the table of OVSR-Adj for for 8 bits frame */
};

/**
  * @brief The default UART adapter setting. This structure can be used to initial a new
  *        UART adapter for UART 1/2/3/4.
  */
SECTION_UART_RODATA const hal_uart_defconfig_t hal_uart_default_setting_50m = {
	.baudrate = 115200,                 /*!< the baud rate: 115200  */
	.flow_ctrl = UartFlowCtlNone,       /*!< flow control setting */
	.word_len = 8,                      /*!< frame length: 8 bits */
	.stop_bit = 1,                      /*!< stop bit: 1 stop bit */
	.parity_type = UartParityNone,      /*!< parity check: none  */
	.pdef_baudrate_tbl = def_baudrate_table,            /*!< the pre-defined support baud rate table */
	.pdef_ovsr_tbl = def_ovsr_50m,                      /*!< OVSR table for pre-defined baud rate */
	.pdef_div_tbl = def_div_50m,                        /*!< the table of DIV for pre-defined baud rate */
	.pdef_ovsradjbit_tbl10 = def_ovsr_adj_bit_10b_50m,  /*!< the table of OVSR-Adj bits for 10 bits frame */
	.pdef_ovsradjbit_tbl9 = def_ovsr_adj_bit_9b_50m,    /*!< the table of OVSR-Adj bits for 9 bits frame */
	.pdef_ovsradjbit_tbl8 = def_ovsr_adj_bit_8b_50m,    /*!< the table of OVSR-Adj bits for 8 bits frame */
	.pdef_ovsradj_tbl10 = ovsr_adj_table_10bit,         /*!< the table of OVSR-Adj for for 10 bits frame */
	.pdef_ovsradj_tbl9 = ovsr_adj_table_9bit,           /*!< the table of OVSR-Adj for for 9 bits frame */
	.pdef_ovsradj_tbl8 = ovsr_adj_table_8bit            /*!< the table of OVSR-Adj for for 8 bits frame */
};


/**
  * @brief The global common data structure to store common resource
  *        for all UART adapters.
  */
SECTION_UART_BSS hal_uart_adapter_t *_puart_adapter[5];

/// @cond DOXYGEN_ROM_HAL_API

/**
 * @addtogroup hs_hal_uart_rom_func UART HAL ROM APIs.
 * @ingroup hs_hal_uart
 * @{
 * @brief UART HAL ROM API. The user application(in RAM space) should not call these APIs directly.
 *        There is another set of UART HAL APIs in the RAM space is provided for the user application.
 */

/**
  * @brief The stubs functions table to exports UART HAL functions in ROM.
  */
SECTION_UART_STUBS const hal_uart_func_stubs_t hal_uart_stubs = {
	.hal_uart_reset_rx_fifo = hal_rtl_uart_reset_rx_fifo,
	.hal_uart_gen_baudrate = hal_rtl_uart_gen_baudrate,
	.hal_uart_set_baudrate = hal_rtl_uart_set_baudrate,
	.hal_uart_set_format = hal_rtl_uart_set_format,
	.hal_uart_set_flow_control = hal_rtl_uart_set_flow_control,
	.hal_uart_init = hal_rtl_uart_init,
	.hal_uart_deinit = hal_rtl_uart_deinit,
	.uart_irq_handler = _uart_irq_handler,
	.hal_uart_tx_gdma_init = hal_rtl_uart_tx_gdma_init,
	.hal_uart_tx_gdma_deinit = hal_rtl_uart_tx_gdma_deinit,
	.hal_uart_rx_gdma_init = hal_rtl_uart_rx_gdma_init,
	.hal_uart_rx_gdma_deinit = hal_rtl_uart_rx_gdma_deinit,
	.uart_tx_dma_irq_handler = _uart_tx_dma_irq_handler,
	.uart_rx_dma_irq_handler = _uart_rx_dma_irq_handler,
	.hal_uart_writeable = hal_rtl_uart_writeable,
	.hal_uart_putc = hal_rtl_uart_putc,
	.hal_uart_wputc = hal_rtl_uart_wputc,
	.hal_uart_wait_tx_done = hal_rtl_uart_wait_tx_done,
	.hal_uart_send = hal_rtl_uart_send,
	.hal_uart_int_send = hal_rtl_uart_int_send,
	.hal_uart_dma_send = hal_rtl_uart_dma_send,
	.hal_uart_send_abort = hal_rtl_uart_send_abort,
	.hal_uart_readable = hal_rtl_uart_readable,
	.hal_uart_getc = hal_rtl_uart_getc,
	.hal_uart_rgetc = hal_rtl_uart_rgetc,
	.hal_uart_recv = hal_rtl_uart_recv,
	.hal_uart_int_recv = hal_rtl_uart_int_recv,
	.hal_uart_dma_recv = hal_rtl_uart_dma_recv,
	.hal_uart_recv_abort = hal_rtl_uart_recv_abort,
	.hal_uart_set_rts = hal_rtl_uart_set_rts,
	.hal_uart_tx_pause = hal_rtl_uart_tx_pause,
	.hal_uart_reg_irq = hal_rtl_uart_reg_irq,
	.hal_uart_unreg_irq = hal_rtl_uart_unreg_irq,
	.hal_uart_adapter_init = hal_rtl_uart_adapter_init,
	.hal_uart_line_sts_hook = hal_rtl_uart_line_sts_hook,
	.hal_uart_txtd_hook = hal_rtl_uart_txtd_hook,
	.hal_uart_rxind_hook = hal_rtl_uart_rxind_hook,
	.hal_uart_txdone_hook = hal_rtl_uart_txdone_hook,
	.hal_uart_rxdone_hook = hal_rtl_uart_rxdone_hook,
	.hal_uart_set_rx_filter_pattern = hal_rtl_uart_set_rx_filter_pattern,
	.hal_uart_set_rx_filter_op = hal_rtl_uart_set_rx_filter_op,
	.hal_uart_set_rx_filter_timeout = hal_rtl_uart_set_rx_filter_timeout,
	.hal_uart_rx_filter_en = hal_rtl_uart_rx_filter_en,
	.hal_uart_rx_filter_dis = hal_rtl_uart_rx_filter_dis,
	.hal_uart_reset_receiver = hal_rtl_uart_reset_receiver,
	.hal_uart_set_tx_fifo_level = hal_rtl_uart_set_tx_fifo_level,
	.hal_uart_set_rx_fifo_level = hal_rtl_uart_set_rx_fifo_level,
	.hal_uart_rx_idle_timeout_en = hal_rtl_uart_rx_idle_timeout_en,
	.hal_uart_rx_idle_timeout_dis = hal_rtl_uart_rx_idle_timeout_dis,
	.hal_uart_en_ctrl = hal_rtl_uart_en_ctrl,
	.hal_uart_tx_fifo_low_hook = hal_rtl_uart_tx_fifo_low_hook,
	.hal_uart_pin_to_idx = hal_rtl_uart_pin_to_idx,
	.hal_uart_tx_isr = uart_tx_isr,
	.hal_uart_rx_isr = uart_rx_isr,
	.hal_uart_iir_isr = uart_iir_isr,
	.hal_uart_baud_rate_table_dump = hal_rtl_uart_baud_rate_table_dump,
	.hal_uart_lp_sclk_select = hal_rtl_uart_lp_sclk_select,
	.hal_uart_set_default_state = hal_rtl_uart_set_default_state,
	.hal_uart_load_default_state = hal_rtl_uart_load_default_state
};

/**
 *  @brief The TX interrupt handler for the interrupt mode transmission.
 *         This interrupt will be triggered whenever the TX FIFO level
 *         lower than threshold.
 *  @param[in]  puart_adapter The UART adapter.
 *
 *  @returns void
 */
SECTION_UART_TEXT
void uart_tx_isr(phal_uart_adapter_t puart_adapter)
{
	UART_Type *puart;
	uint32_t buf_size;

