swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
	if (puart_adapter == NULL) {
		return;
	}

	puart = puart_adapter->base_addr;

	while (puart_adapter->tx_count > 0) {
		buf_size = Uart_Tx_FIFO_Size - puart->tflvr_b.tx_fifo_lv;
		if (buf_size > 0) {
			if (buf_size > puart_adapter->tx_count) {
				buf_size = puart_adapter->tx_count;
			}
			for (; buf_size > 0; buf_size--) {
				puart->thr = (uint8_t)(*(puart_adapter->ptx_buf));
				puart_adapter->tx_count--;
				puart_adapter->ptx_buf++;
			}
		} else {
			break;
		}
	}

	if (0 == puart_adapter->tx_count) {
		// Disable Tx FIFO low interrupt
		puart->vier_b.tx_fifo_lv_int_en = 0;
		// call TX FIFO low event callback
		if (puart_adapter->tx_fifo_low_callback != NULL) {
			(puart_adapter->tx_fifo_low_callback)(puart_adapter->tx_fifo_low_cb_para);
		}
		// Enable TX FIFO empty interrupt (TX totally done)
		puart->ier_b.etbei = 1;
	}
}

/**
 *  @brief The RX interrupt handler for the interrupt mode transmission
 *         This interrupt will be triggeren whenever the RX FIFO level
 *         over the thread or data ready timeout.
 *  @param[in]  puart_adapter The UART adapter.
 *
 *  @returns void
 */
SECTION_UART_TEXT
void uart_rx_isr(phal_uart_adapter_t puart_adapter)
{
	UART_Type *puart = puart_adapter->base_addr;
	volatile uint32_t bytes_in_fifo;
	uart_lsr_t lsr;
	uint8_t lsr_err;
	uint8_t lsr_err_sum;

	while (puart_adapter->rx_count > 0) {
		bytes_in_fifo = puart->rflvr_b.rx_fifo_lv;
		if (bytes_in_fifo > 0) {
			if (bytes_in_fifo > puart_adapter->rx_count) {
				bytes_in_fifo = puart_adapter->rx_count;
			}

			lsr.w = puart->lsr;
			lsr.w |= puart_adapter->lsr;
			puart_adapter->lsr = 0;
			if (lsr.b.rxfifo_err == 0) {
				for (; bytes_in_fifo > 0; bytes_in_fifo--) {
					*(puart_adapter->prx_buf) = (uint8_t)puart->rbr;
					puart_adapter->rx_count--;
					puart_adapter->prx_buf++;
				}
			} else {
				// line status error: pop RX FIFO and read LSR for every RX byte
				lsr_err_sum = HAL_UART_STATUS_ERR_RXFIFO;
				for (; bytes_in_fifo > 0; bytes_in_fifo--) {
					*(puart_adapter->prx_buf) = (uint8_t)puart->rbr;
					// read LSR after every RBR reading, to get the LSR for the read RX byte
					lsr_err = puart->lsr & UART_LSR_ERR;
					if (lsr_err != 0) {
						if (puart_adapter->lsr_callback != NULL) {
							puart_adapter->lsr_callback(lsr_err, puart_adapter->lsr_cb_para);
						}
						lsr_err_sum |= lsr_err;
					}
					puart_adapter->rx_count--;
					puart_adapter->prx_buf++;
				}
				puart_adapter->rx_status |= lsr_err_sum;
			}
		} else {
			break;
		}
	}

	if (puart_adapter->rx_count == 0) {
		// Disable RX trigger Interrupt
		if (puart_adapter->rx_dr_callback == NULL) {
			puart->ier_b.erbi = 0;
		}

		uart_clear_state(puart_adapter, HAL_UART_STATE_RX_BUSY);

		// Call User Rx complete callback
		if (puart_adapter->rx_done_callback != NULL) {
			puart_adapter->rx_done_callback(puart_adapter->rx_done_cb_para);
		}
	}
}



/**
 *  @brief The ISR for the IIR events processing.
 *  @param[in]  puart_adapter The UART adapter.
 *
 *  @returns void
 */
SECTION_UART_TEXT
void uart_iir_isr(phal_uart_adapter_t puart_adapter)
{
	UART_Type *puart = puart_adapter->base_addr;
	volatile uart_iir_t reg_iir;
	uint8_t lsr;
	uint8_t int_id;
	int i;

	for (i = 0; i < 5; i++) {
		// Maximum process 5 different interrupt events
		reg_iir.w = puart->iir;
		if (reg_iir.b.int_pend != 0) {
			// No pending IRQ
			break;
		}

		int_id = reg_iir.b.int_id;

		switch (int_id) {
		case ModemStatus:
			puart_adapter->modem_status = (uint8_t)puart->msr;
			// Call the Modem Status handler
			if (puart_adapter->modem_status_ind != NULL) {
				puart_adapter->modem_status_ind(puart_adapter);
			}
			break;

		case TxFifoEmpty:
			if (puart->ier_b.etbei == 0) {
				// got TX FIFO empty IRQ while this IRQ is disabled
				// It could be caused by multiple-issue when etbei = 1, so just ignore it for this case
				break;
			}

			if (puart_adapter->state & (HAL_UART_STATE_TX_BUSY | HAL_UART_STATE_DMATX_BUSY)) {
				uart_clear_state(puart_adapter, (HAL_UART_STATE_TX_BUSY | HAL_UART_STATE_DMATX_BUSY));
				// Call user TX complete callback
				if (NULL != puart_adapter->tx_done_callback) {
					puart_adapter->tx_done_callback(puart_adapter->tx_done_cb_para);
				}
				// Disable TX FIFO empty interrupt (TX totally done)
				puart->ier_b.etbei = 0;
			} else {
				// Call Tx done callback
				if (puart_adapter->tx_td_callback != NULL) {
					puart_adapter->tx_td_callback(puart_adapter->tx_td_cb_id, puart_adapter->tx_td_cb_ev);
				} else {
					// Disable TX FIFO empty interrupt
					puart->ier_b.etbei = 0;
				}
			}
			break;

		case ReceiverDataAvailable:
		case TimeoutIndication:
			if (puart_adapter->state & HAL_UART_STATE_RX_BUSY) {
				uart_rx_isr(puart_adapter);
			} else if ((puart_adapter->state & HAL_UART_STATE_DMARX_BUSY) == 0) {
				// Call Rx data ready callback
				if (puart_adapter->rx_dr_callback != NULL) {
					if (puart->rflvr_b.rx_fifo_lv > 0) {
						puart_adapter->rx_dr_callback(puart_adapter->rx_dr_cb_id, puart_adapter->rx_dr_cb_ev);
					}
				}
			}
			break;

		case ReceivLineStatus:
			lsr = puart->lsr & UART_LSR_ERR;
			puart_adapter->rx_status |= lsr;
			if (puart_adapter->lsr_callback != NULL) {
				puart_adapter->lsr_callback(lsr, puart_adapter->lsr_cb_para);
			}
			break;

		default:
			DBG_UART_ERR(ANSI_COLOR_RED"Unknown Interrupt Type\n"ANSI_COLOR_RESET);
			break;
		}
	}
}

/**
 *  @brief The default UART interrupt handler. It process all interrupt events.
 *
 *  @param[in]  puart_adapter The UART adapter.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void _uart_irq_handler(phal_uart_adapter_t puart_adapter)
{
	UART_Type *puart = puart_adapter->base_addr;
	uart_visr_t visr;

	if (puart->iir_b.int_pend == 0) {
		uart_iir_isr(puart_adapter);
	}

	visr.w = puart->visr & puart->vier;
	if (visr.w != 0) {
		if (visr.b.rx_idle_timeout) {
			// RX idle timeout
			puart->visr_b.rx_idle_timeout_int_sts = 1;   // clear interrupt
			if (puart_adapter->rx_idle_timeout_callback) {
				(puart_adapter->rx_idle_timeout_callback)(puart_adapter->rx_idle_timeout_cb_arg);
			}
		}

		if (visr.b.rf_match_patt) {
			puart->visr_b.rf_patt_match_int_sts = 1;   // clear interrupt
			if (puart_adapter->rx_flt_matched_callback) {
				(puart_adapter->rx_flt_matched_callback)(puart_adapter->rx_flt_matched_cb_arg);
			}
		}

		if (visr.b.rf_timeout) {
			puart->visr_b.rf_idle_timeout_int_sts = 1;   // clear interrupt
			if (puart_adapter->rx_flt_timeout_callback) {
				(puart_adapter->rx_flt_timeout_callback)(puart_adapter->rx_flt_timeout_cb_arg);
			}
		}

		if (visr.b.tx_fifo_lv) {
			puart->visr_b.tx_fifo_lv_int_sts = 1;   // clear interrupt
			if (puart_adapter->state & HAL_UART_STATE_TX_BUSY) {
				uart_tx_isr(puart_adapter);
			} else {
				// Disable Tx FIFO low interrupt
				puart->vier_b.tx_fifo_lv_int_en = 0;
			}
		}
	}

	if (puart->iir_b.int_pend == 0) {
		uart_iir_isr(puart_adapter);
	}

