swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
}


SECTION_UART_TEXT
void UART0_IRQHandler(void)
{

	hal_rtl_irq_clear_pending(UART0_IRQn);
	_puart_adapter[0]->irq_fun((void *)_puart_adapter[0]);
	__ISB();
}

SECTION_UART_TEXT
void UART1_IRQHandler(void)
{

	hal_rtl_irq_clear_pending(UART1_IRQn);
	_puart_adapter[1]->irq_fun((void *)_puart_adapter[1]);
	__ISB();
}

SECTION_UART_TEXT
void UART2_IRQHandler(void)
{

	hal_rtl_irq_clear_pending(UART2_IRQn);
	_puart_adapter[2]->irq_fun((void *)_puart_adapter[2]);
	__ISB();
}

SECTION_UART_TEXT
void UART3_IRQHandler(void)
{

	hal_rtl_irq_clear_pending(UART3_IRQn);
	_puart_adapter[3]->irq_fun((void *)_puart_adapter[3]);
	__ISB();
}

SECTION_UART_TEXT
void BTUART_IRQHandler(void)
{

	hal_rtl_irq_clear_pending(BTUART_IRQn);
	_puart_adapter[4]->irq_fun((void *)_puart_adapter[4]);
	__ISB();
}

/**
 *  @brief The TX DMA interrupt handler. This interrupt will be triggered when
 *         a TX DMA mode transfer is done.
 *
 *  @param[in]  puart_adapter The UART adapter.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void _uart_tx_dma_irq_handler(phal_uart_adapter_t puart_adapter)
{
	UART_Type *puart = puart_adapter->base_addr;

	puart->miscr_b.txdma_en = 0; // Disable UART TX DMA

	// update TX Buffer adddr
	puart_adapter->ptx_buf = (uint8_t *)((uint32_t)(puart_adapter->ptx_buf_sar) + puart_adapter->tx_count);

	// Wait all data in TX FIFO to be transfered
	// Enable TX FIFO empty interrupt (TX totally done)
	if (puart->tflvr_b.tx_fifo_lv == 0) {
		// Call user TX complete callback
		if (NULL != puart_adapter->tx_done_callback) {
			puart_adapter->tx_done_callback(puart_adapter->tx_done_cb_para);
		}
		uart_clear_state(puart_adapter, HAL_UART_STATE_DMATX_BUSY);
	} else {
		puart->ier_b.etbei = 1;
	}
}

/**
 *  @brief The RX DMA interrupt handler. This interrupt will be triggered when
 *         a RX DMA mode transfer is done.
 *
 *  @param[in]  puart_adapter The UART adapter.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void _uart_rx_dma_irq_handler(phal_uart_adapter_t puart_adapter)
{
	UART_Type *puart = puart_adapter->base_addr;

	puart->miscr_b.rxdma_en = 0; // Disable UART RX DMA
	uart_clear_state(puart_adapter, HAL_UART_STATE_DMARX_BUSY);

	// D-Cache sync (Invalidate)
	if (puart_adapter->dcache_invalidate_by_addr != NULL) {
		puart_adapter->dcache_invalidate_by_addr((uint32_t *)puart_adapter->prx_buf_dar, (int32_t)puart_adapter->rx_count);
	}

	puart_adapter->prx_buf = (uint8_t *)((uint32_t)(puart_adapter->prx_buf_dar) + puart_adapter->rx_count);

	// Call User Rx complete callback
	if (puart_adapter->rx_done_callback != NULL) {
		puart_adapter->rx_done_callback(puart_adapter->rx_done_cb_para);
	}
}


/**
 *  @brief To enable or disable an UART device. It controls the
 *         hardware function, bus domain, PCLK and SCLK of the
 *         specified UART.
 *
 *  @param[in]  uart_idx The UART index. The value can be 0 .. 2.
 *  @param[in]  en  Enable control:
 *                    - 0: Fully disable the UART hardware(function and clock).
 *                    - 1: Fully enable the UART hardware(function and clock).
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_en_ctrl(uint8_t uart_idx, BOOL en)
{
#if !defined(CONFIG_BUILD_NONSECURE)
	//enable UART fun/BUS/SCLK/PCLK
	switch (uart_idx) {
	case Uart0:
		hal_rtl_sys_peripheral_en(UART0_SYS, en);
		break;

	case Uart1:
		hal_rtl_sys_peripheral_en(UART1_SYS, en);
		break;

	case Uart2:
		hal_rtl_sys_peripheral_en(UART2_SYS, en);
		break;

	case Uart3:
		hal_rtl_sys_peripheral_en(UART3_SYS, en);
		break;

	case Uart4:
		hal_rtl_sys_peripheral_en(UART4_SYS, en);    //BTUART
		break;

	default:
		// error, invalid UART Index
		return;
	}
#endif
	return;
}

/**
 *  @brief To set a state flag of the UART.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  state  The state flag going to be set.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void uart_set_state(phal_uart_adapter_t puart_adapter, uint32_t state)
{
	puart_adapter->state |= state;
}

/**
 *  @brief To register a interrupt handler for the given UART port.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  handler  The interrupt handle function.
 *
 *  @returns void
 */
SECTION_UART_TEXT
void hal_rtl_uart_reg_irq(phal_uart_adapter_t puart_adapter, irq_handler_t handler)
{
	uint8_t uart_idx;
	uint8_t uart_irq = 0xFF;
	uint8_t uart_irq_pri = 0xFF;
	uint32_t vector = 0x0;

	uart_idx = puart_adapter->uart_idx;

	switch (uart_idx) {
	case Uart0:
		uart_irq = UART0_IRQn;
		uart_irq_pri = UART0_IRQPri;
		vector = (uint32_t)&UART0_IRQHandler;
		break;

	case Uart1:
		uart_irq = UART1_IRQn;
		uart_irq_pri = UART1_IRQPri;
		vector = (uint32_t)&UART1_IRQHandler;
		break;

	case Uart2:
		uart_irq = UART2_IRQn;
		uart_irq_pri = UART2_IRQPri;
		vector = (uint32_t)&UART2_IRQHandler;
		break;

	case Uart3:
		uart_irq = UART3_IRQn;
		uart_irq_pri = UART3_IRQPri;
		vector = (uint32_t)&UART3_IRQHandler;
		break;

	case Uart4:
		uart_irq = BTUART_IRQn;
		uart_irq_pri = BTUART_IRQPri;
		vector = (uint32_t)&BTUART_IRQHandler;
		break;

	default:
		// error, invalid UART Index
		break;
	}

	hal_rtl_irq_disable(uart_irq);
	__ISB();

	// Register UART    IRQ  to Vector table
	hal_rtl_irq_set_vector(uart_irq, vector);
	hal_rtl_irq_clear_pending(uart_irq);
	hal_rtl_irq_set_priority(uart_irq, uart_irq_pri);

	hal_rtl_irq_enable(uart_irq);

	//hook irq handler
	puart_adapter->irq_fun = handler;
}

/**
 *  @brief To un-register the interrupt handler of the given UART port.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_unreg_irq(phal_uart_adapter_t puart_adapter)
{
	uint8_t uart_idx = puart_adapter->uart_idx;
	uint8_t uart_irq = 0xFF;

	switch (uart_idx) {
	case Uart0:
		uart_irq = UART0_IRQn;
		break;

	case Uart1:
		uart_irq = UART1_IRQn;
		break;

	case Uart2:
		uart_irq = UART2_IRQn;
		break;

	case Uart3:
		uart_irq = UART3_IRQn;
		break;

	case Uart4:
		uart_irq = BTUART_IRQn;
		break;

	default:
		// error, invalid UART Index
		break;
	}

	if (uart_idx < MaxUartNum) {
		_puart_adapter[uart_idx]->irq_fun = (irq_handler_t)NULL;
		hal_rtl_irq_disable(uart_irq);
	}
}

/**
 *  @brief Resets the RX FIFO and the receiver.
 *         The reset steps are:
 *           1. Assert receiver reset hardware bit.
 *           2. Assert clear_rxfifo hardware bit.
 *           3. De-assert receiver reset hardware bit.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *
 *  @returns    Always return HAL_OK.
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_reset_rx_fifo(phal_uart_adapter_t puart_adapter)
{
	UART_Type *puart;

