swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
	puart = puart_adapter->base_addr;

	/* Step 1: Enable Reset_rcv */
	puart->stsr_b.reset_rcv = 1;

	/* clear RX fifo */
	puart->fcr_b.clear_rxfifo = 1;
	__NOP();
	__NOP();

	/* Step 3: Disable Reset_rcv */
	puart->stsr_b.reset_rcv = 0;

	return HAL_OK;
}

/**
 *  @brief Calculates the divisor, over sampling for a given baud rate.
 *
 *  @param[in]  pbaud_setting The needed parameters, baud rate and system clock
 *                                for the calculation. The result also will be passed by
 *                                this structure.
 *
 *  @returns        Always return HAL_OK.
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_gen_baudrate(uart_speed_setting_t *pbaud_setting)
{
	float divid_f;
	float ovsr_f;
	float ovsr_mod_f;
	float bit_adj_f;
	float best_ovsr_f;
	float best_ovsr_mod_f;
	uint32_t divisor;
	uint32_t best_divisor;
	uint32_t ovsr_d;
	uint32_t adj_bits;
	uint32_t ovsr_adj;

	divid_f = (float)pbaud_setting->sclk / (float)pbaud_setting->baudrate;
	best_ovsr_f = 20.0f;
	best_divisor = (uint32_t)(divid_f / 20.0f);

	//DBG_UART_INFO("divid_f = %f\r\n", divid_f);

	divisor = 1;
	//ovsr_f = 100.0f;
	best_ovsr_mod_f = 1.0f;
	while (1) {
		ovsr_f = divid_f / (float)divisor;
		if (ovsr_f  < 21.0f) {
			ovsr_d = (uint32_t)(ovsr_f / 1.00f);
			ovsr_mod_f = ovsr_f - (float)ovsr_d;
			if (ovsr_mod_f < 0.01f) {
				//best_ovsr_mod_f = ovsr_mod_f;
				best_ovsr_f = ovsr_f;
				best_divisor = divisor;
				break;
			} else if (ovsr_mod_f < best_ovsr_mod_f) {
				//best_ovsr_mod_f = ovsr_mod_f;
				best_ovsr_f = ovsr_f;
				best_divisor = divisor;
				if (ovsr_f <= 10.0f) {
					break;
				}
			} else if (ovsr_f <= 10.0f) {
				if (ovsr_mod_f < best_ovsr_mod_f) {
					//best_ovsr_mod_f = ovsr_mod_f;
					best_ovsr_f = ovsr_f;
					best_divisor = divisor;
				}
				break;
			}
		}
		divisor++;
	}

	//DBG_UART_INFO("divisor = %u ovsr_f=%f\r\n",divisor, ovsr_f);

	ovsr_d = (uint32_t)(best_ovsr_f / 1.00f);
	bit_adj_f = 1.0f / (float)pbaud_setting->ovsr_adj_max_bits;
	adj_bits = (uint32_t)(((best_ovsr_f - (float)ovsr_d) * 10.0f) / bit_adj_f);
	if ((adj_bits % 10) > 5) {
		adj_bits = adj_bits / 10 + 1;
	} else {
		adj_bits = adj_bits / 10;
	}
	//DBG_UART_INFO("adj_bits = %u\r\n",adj_bits);

	if (adj_bits > (pbaud_setting->ovsr_adj_max_bits - 1)) {
		//DBG_UART_WARN("HalRuartGenBaudRateRtl8195a: adj_bits=%d\r\n", adj_bits);
		ovsr_d++;
		adj_bits = 0;
	}

	ovsr_adj = pbaud_setting->ovsr_adj_map[adj_bits];

	pbaud_setting->ovsr = ovsr_d;
	pbaud_setting->div = best_divisor;
	pbaud_setting->ovsr_adj = ovsr_adj;
	pbaud_setting->ovsr_adj_bits = (uint8_t)adj_bits;

	return HAL_OK;
}


/**
 *  @brief Configures the baud rate setting.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  baudrate  The baud rate setting. If the baud rate value is invalid then
 *                        baud rate 9600 will be the used for the configuration.
 *
 *  @returns    Always return HAL_OK
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_set_baudrate(phal_uart_adapter_t puart_adapter, uint32_t baudrate)
{
	uart_speed_setting_t uart_speed_setting;
	uint32_t dll;
	uint32_t dlm;
	uint32_t divisor = 490;
	uint32_t ovsr = 17;
	uint32_t ovsr_adj = 0;
	uint32_t i;
	uint8_t is_defined_baud;
	uint8_t frame_bits;
	uint8_t adj_bits;
	UART_Type *puart;

	frame_bits = puart_adapter->word_len + 1; // 1 start bit + data bits
	if (puart_adapter->parity_type != UartParityNone) {
		frame_bits++;   // 1 parity bit
	}

	is_defined_baud = 0;

	if (puart_adapter->pdef_baudrate_tbl != NULL) {
		i = 0;

		while (puart_adapter->pdef_baudrate_tbl[i] < 0xffffffff) {
			if (puart_adapter->pdef_baudrate_tbl[i] == baudrate) {
				divisor = puart_adapter->pdef_div_tbl[i];
				ovsr = puart_adapter->pdef_ovsr_tbl[i];
				switch (frame_bits) {
				case 9:
					adj_bits = puart_adapter->pdef_ovsradjbit_tbl9[i];
					ovsr_adj = puart_adapter->pdef_ovsradj_tbl9[adj_bits];
					break;
				case 10:
					adj_bits = puart_adapter->pdef_ovsradjbit_tbl10[i];
					ovsr_adj = puart_adapter->pdef_ovsradj_tbl10[adj_bits];
					break;
				case 8:
					adj_bits = puart_adapter->pdef_ovsradjbit_tbl8[i];
					ovsr_adj = puart_adapter->pdef_ovsradj_tbl8[adj_bits];
					break;

				default:
					adj_bits = puart_adapter->pdef_ovsradjbit_tbl9[i];
					ovsr_adj = puart_adapter->pdef_ovsradj_tbl9[adj_bits];
					break;
				}
				is_defined_baud = 1;
				break;  // break the while loop
			} else {
				i++;
			}
		}
	}

	if (is_defined_baud == 0) {
		switch (frame_bits) {
		case 9:
			uart_speed_setting.ovsr_adj_map = puart_adapter->pdef_ovsradj_tbl9;
			break;

		case 10:
			uart_speed_setting.ovsr_adj_map = puart_adapter->pdef_ovsradj_tbl10;
			break;

		case 8:
			uart_speed_setting.ovsr_adj_map = puart_adapter->pdef_ovsradj_tbl8;
			break;

		default:
			frame_bits = 9;
			uart_speed_setting.ovsr_adj_map = puart_adapter->pdef_ovsradj_tbl9;
			break;
		}
		DBG_UART_WARN("BaudRate(%u) not in the Lookup table \n", baudrate);
		uart_speed_setting.ovsr_adj_max_bits = frame_bits;
		uart_speed_setting.max_err = 3;
		uart_speed_setting.ovsr_min = UART_OVSR_POOL_MIN;
		uart_speed_setting.ovsr_max = UART_OVSR_POOL_MAX;
		uart_speed_setting.divisor_resolution = DIVISOR_RESOLUTION;
		uart_speed_setting.jitter_lim = JITTER_LIMIT;
		uart_speed_setting.baudrate = baudrate;
		switch (puart_adapter->uart_sclk) {
		case UartSCLK_4M:
			uart_speed_setting.sclk = UART_SCLK_4M;
			break;
		case UartSCLK_26M:
			uart_speed_setting.sclk = UART_SCLK_26M;
			break;

		case UartSCLK_40M:
			uart_speed_setting.sclk = UART_SCLK_40M;
			break;

		case UartSCLK_50M:
			uart_speed_setting.sclk = UART_SCLK_50M;
			break;

		default:
			if (puart_adapter->uart_idx == Uart0) {
				//for uart0
				uart_speed_setting.sclk = UART_SCLK_40M;
			} else {
				//for uart1~4
				uart_speed_setting.sclk = UART_SCLK_50M;
			}
			break;
		}

		if (hal_rtl_uart_gen_baudrate(&uart_speed_setting) == HAL_OK) {
			divisor = uart_speed_setting.div;
			ovsr = uart_speed_setting.ovsr;
			ovsr_adj = uart_speed_setting.ovsr_adj;
		} else {
			DBG_UART_ERR("Invalid BaudRate(%d), Force Baud Rateit as 9600\n", baudrate);
			if (puart_adapter->uart_idx == Uart0) {
				//for uart0
				divisor = 490;
				ovsr = 17;
				ovsr_adj = 0;
				baudrate = 9600;
			} else {
				//for uart1~4
				divisor = 548;
				ovsr = 19;
				ovsr_adj = 0;
				baudrate = 9600;
			}
		}
	}

	DBG_UART_INFO("uart_set_baudrate: BaudRate:%d Divisor:%d Ovsr:%d Ovsr_ADj:0x%x\r\n",
				  baudrate, divisor, ovsr, ovsr_adj);

