swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
	puart = puart_adapter->base_addr;

	dll = divisor & 0xFF;
	dlm = (divisor & 0xFF00) >> 8;

	/* Set DLAB bit to 1 to access DLL/DLM */
	puart->lcr_b.dlab = 1;

#if CONFIG_PXP
	/* set divisor */
	puart->dllr = 1;
#else
	/* set divisor */
	puart->dllr = dll;
#endif

	puart->dlmr = dlm;

	/**
	  * Clean Rx break signal interrupt status at initial stage.
	  */
	puart->scr_b.rx_break_int_sts = 1;

#if CONFIG_PXP
	/* Set OVSR(xfactor) */
	puart->stsr_b.xfactor = 0xB;

	/* Set OVSR_ADJ[10:0] (xfactor_adj[26:16]) */
	puart->scr_b.xfactor_adj = 0;
#else
	/* Set OVSR(xfactor) */
	puart->stsr_b.xfactor = ovsr - 5;

	/* Set OVSR_ADJ[10:0] (xfactor_adj[26:16]) */
	puart->scr_b.xfactor_adj = ovsr_adj;
#endif
	/* clear DLAB bit */
	puart->lcr_b.dlab = 0;

	puart_adapter->baudrate = baudrate;
	puart_adapter->frame_bits = frame_bits;

	return HAL_OK;
}

SECTION_UART_TEXT
void hal_rtl_uart_baud_rate_table_dump(uint32_t sclk, uint32_t *baudrate_tbl)
{
	uart_speed_setting_t uart_speed_setting;
	uint32_t i, j;
	uint32_t best_divisor;
	uint32_t ovsr_d;
	uint32_t adj_bits;
	uint32_t ovsr_adj;
	uint32_t actural_baud;
	uint32_t baudrate;
	float act_divid_f;

	uart_speed_setting.max_err = 3;
	uart_speed_setting.ovsr_min = UART_OVSR_POOL_MIN;
	uart_speed_setting.ovsr_max = UART_OVSR_POOL_MAX;
	uart_speed_setting.divisor_resolution = DIVISOR_RESOLUTION;
	uart_speed_setting.jitter_lim = JITTER_LIMIT;
	uart_speed_setting.sclk = sclk;

	for (j = 8; j < 11; j++) {
		uart_speed_setting.ovsr_adj_max_bits = (uint8_t)j;
		if (j == 8) {
			uart_speed_setting.ovsr_adj_map = ovsr_adj_table_8bit;
		} else if (j == 9) {
			uart_speed_setting.ovsr_adj_map = ovsr_adj_table_9bit;
		} else {
			uart_speed_setting.ovsr_adj_map = ovsr_adj_table_10bit;
		}

		DBG_UART_INFO("===== %u frame bits ====\r\n", j);
		i = 0;
		while (baudrate_tbl[i] != 0xffffffff) {
			baudrate = baudrate_tbl[i];
			uart_speed_setting.baudrate = baudrate;
			hal_rtl_uart_gen_baudrate(&uart_speed_setting);

			ovsr_d = uart_speed_setting.ovsr;
			best_divisor = uart_speed_setting.div;
			ovsr_adj = uart_speed_setting.ovsr_adj;
			adj_bits = uart_speed_setting.ovsr_adj_bits;

			DBG_UART_INFO("BaudRate=%8u ovsr=%2u divisor=%6u ovsr_adj=0x%04x adj_bits=%4u ",
						  baudrate, ovsr_d, best_divisor, ovsr_adj, adj_bits);

			act_divid_f = ((float)ovsr_d + ((float)adj_bits / (float)uart_speed_setting.ovsr_adj_max_bits)) * (float)best_divisor;
			actural_baud = (uint32_t)((float)sclk / (act_divid_f));
			if (actural_baud > baudrate) {
				DBG_UART_INFO("actural_baud=%8u err=%f\r\n", actural_baud, (float)((float)(actural_baud - baudrate) * 100.0f / (float)baudrate));
			} else {
				DBG_UART_INFO("actural_baud=%8u err=%f\r\n", actural_baud, (float)((float)(baudrate - actural_baud) * 100.0f / (float)baudrate));
			}

			i++;
		}

	}
}


/**
 *  @brief Configures the UART frame format.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  data_bis  The number of bits in a UART word. This value can be 7 or 8.
 *  @param[in]  parity  The parity type.
 *                      - 0: No parity bit.
 *                      - 1: Odd parity.
 *                      - 2: Even parity.
 *                      - 3: Parity bit value always is 1.
 *                      - 4: Parity bit value always is 0.
 *  @param[in]  stop_bits  The number of stop bits. This value can be 1 or 2.
 *
 *  @returns    Always return HAL_OK
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_set_format(phal_uart_adapter_t puart_adapter, uint32_t data_bits,
									 uint32_t parity, uint32_t stop_bits)
{
	UART_Type *puart;
	uart_lcr_t lcr;
	uint32_t parity_en = 0;
	uint32_t parity_type = 0;
	uint32_t stick_parity = 0;
	uint32_t frame_bits = 0;

	puart = puart_adapter->base_addr;

	lcr.w = puart->lcr;

	/* set frame length: 0/1: 7/8 */
	if (data_bits >= 8) {
		// 8 bits
		lcr.b.wls0 = 1;
		data_bits = 8;
	} else {
		// 7 bits
		lcr.b.wls0 = 0;
		data_bits = 7;
	}

	/* set stop bit: 0/1: 1/2 */
	if (stop_bits < 2) {
		// stop bit = 1
		lcr.b.stb = 0;
		stop_bits = 1;
	} else {
		// stop bit = 2
		lcr.b.stb = 1;
		stop_bits = 2;
	}

	switch (parity) {
	case UartParityNone:
		parity_en = UartParityDisable;
		stick_parity = 0;
		break;

	case UartParityOdd:
		parity_en = UartParityEnable;
		parity_type = 0;
		stick_parity = 0;
		break;

	case UartParityEven:
		parity_en = UartParityEnable;
		parity_type = 1;
		stick_parity = 0;
		break;

	case UartParityForced1:
		parity_en = UartParityEnable;
		parity_type = 1;
		stick_parity = 1;
		break;

	case UartParityForced0:
		parity_en = UartParityEnable;
		parity_type = 0;
		stick_parity = 1;
		break;

	default:
		parity_en = UartParityDisable;
		stick_parity = 0;
		parity = UartParityDisable;
		break;
	}

	/* set parity check enable: 0/1: no parity/with parity */
	lcr.b.parity_en = parity_en;
	/* set parity check type: 0/1: odd/even */
	lcr.b.even_parity_sel = parity_type;
	/* stick parity (set parity bit fixed as): 0/1 */
	lcr.b.stick_parity_en = stick_parity;

	puart->lcr = lcr.w;

	puart_adapter->word_len = data_bits;
	puart_adapter->stop_bit = stop_bits;
	puart_adapter->parity_type = parity;

	frame_bits = data_bits + 1;  // 1 start bit + data bits
	if (parity != UartParityDisable) {
		// enable line status interrupt
		puart_adapter->base_addr->ier_b.elsi = 1;
		frame_bits++;   // 1 parity bit
	}

	if ((puart_adapter->frame_bits != frame_bits) && (puart_adapter->baudrate != 0)) {
		// The frame bis changed, need to re-calculate the baud rate
		hal_rtl_uart_set_baudrate(puart_adapter, puart_adapter->baudrate);
	}
	return HAL_OK;
}

/**
 *  @brief Configures the UART hardware auto flow-control setting.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  flow_ctrl  The flow control setting.
 *                           - 0: no hardware flow control.
 *                           - 1: enable RX (RTS) flow control.
 *                           - 2: enable TX (CTS) flow control.
 *                           - 3: enable RTS and CTS hardware flow control.
 *  @param[in]  rts_pin  The RTS pin for the RX flow control.
 *  @param[in]  rts_pin  The CTS pin for the TX flow control.
 *
 *  @returns    Always return HAL_OK
 */
/*
To-Do: pin assign need to fix
*/
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_set_flow_control(phal_uart_adapter_t puart_adapter, uint32_t flow_ctrl)
{
	uart_mcr_t mcr;
	uint8_t uart_idx;

	uart_idx = puart_adapter->uart_idx;
	mcr.w = puart_adapter->base_addr->mcr;
	switch (flow_ctrl) {
	case UartFlowCtlNone:
		mcr.b.cts_en = 0;
		mcr.b.rts_en = 0;
		break;

	case UartFlowCtlRTSCTS:
		mcr.b.cts_en = 1;
		mcr.b.rts_en = 1;
		// get RTS pin and CTS pin by the UART index, RTS/CTS pin has no option (pin number is fixed for each UART)
		puart_adapter->rts_pin = uart_rts_pin_tbl[uart_idx];
		puart_adapter->cts_pin = uart_cts_pin_tbl[uart_idx];
		break;

