swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
	case UartFlowCtlRTS:
		mcr.b.cts_en = 0;
		mcr.b.rts_en = 1;
		puart_adapter->rts_pin = uart_rts_pin_tbl[uart_idx];
		break;

	case UartFlowCtlCTS:
		mcr.b.cts_en = 1;
		mcr.b.rts_en = 0;
		puart_adapter->cts_pin = uart_cts_pin_tbl[uart_idx];
		break;

	default:
		mcr.b.cts_en = 0;
		mcr.b.rts_en = 0;
		flow_ctrl = UartFlowCtlNone;
		break;
	}

	puart_adapter->base_addr->mcr = mcr.w;
	puart_adapter->flow_ctrl = flow_ctrl;

	return HAL_OK;
}

/**
 *  @brief To get the UART port TX FIFO writable status.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *
 *  @return     value 1   TX FIFO is writable (not full).
 *  @return     value 0   TX FIFO is full.
 */
SECTION_UART_TEXT
BOOL hal_rtl_uart_writeable(phal_uart_adapter_t puart_adapter)
{
	if (puart_adapter->base_addr->tflvr_b.tx_fifo_lv < Uart_Tx_FIFO_Size) {
		return TRUE;
	} else {
		return FALSE;
	}
}

/**
 *  @brief To send a char.
 *
 *  @param[in]  puart_adapter The UART adapter.
 *  @param[in]  tx_data The data(1 byte) to be send.
 *
 *  @returns    void.
 */
SECTION_UART_TEXT
void hal_rtl_uart_putc(phal_uart_adapter_t puart_adapter, uint8_t tx_data)
{
	puart_adapter->base_addr->thr = tx_data;
}

/**
 *  @brief To wait TX FIFO is writable and then send a char.
 *
 *  @param[in]  puart_adapter The UART adapter.
 *  @param[in]  tx_data The data(1 byte) to be send.
 *
 *  @returns    void.
 */
SECTION_UART_TEXT
void hal_rtl_uart_wputc(phal_uart_adapter_t puart_adapter, uint8_t tx_data)
{
	while (puart_adapter->base_addr->tflvr_b.tx_fifo_lv >= Uart_Tx_FIFO_Size);
	puart_adapter->base_addr->thr = tx_data;
}

/**
 *  @brief Waits all data in the TX FIFO are transfered.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  timeout_ms  The maximum period(in mini-second) to wait the transfer done.
 *
 *  @returns    void.
 */
SECTION_UART_TEXT
void hal_rtl_uart_wait_tx_done(phal_uart_adapter_t puart_adapter, uint32_t timeout_ms)
{
	uint32_t start_us = 0;
	uart_lsr_t lsr;

	if (timeout_ms > 0) {
		start_us = hal_read_cur_time();
	}

	lsr.w = puart_adapter->base_addr->lsr;
	puart_adapter->lsr |= lsr.w & UART_LSR_ERR;
	while (lsr.b.txfifo_empty == 0) {
		// check timeout
		if ((timeout_ms > 0) && (timeout_ms != UART_WAIT_FOREVER)) {
			if (hal_is_timeout(start_us, timeout_ms * 1000)) {
				break;
			}
		} else if (timeout_ms == 0) {
			// No wait
			break;
		}
		lsr.w = puart_adapter->base_addr->lsr;
		puart_adapter->lsr |= lsr.w & UART_LSR_ERR;
	}
}

/**
 *  @brief To send a block of data.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  ptx_buf  The buffer of data to be transmitted.
 *  @param[in]  len  The length of data in bytes to be transmitted.
 *  @param[in]  timeout_ms  The maximum period(in mini-secand) to wait the data transmission is finished.
 *
 *  @returns    The length of data in byte has been sent.
 */
SECTION_UART_TEXT
uint32_t hal_rtl_uart_send(phal_uart_adapter_t puart_adapter, uint8_t *ptx_buf, uint32_t len, uint32_t timeout_ms)
{
	UART_Type *puart = puart_adapter->base_addr;
	uint32_t start_us = 0;
	uint32_t tx_bytes = 0;
	uart_lsr_t lsr;

	if (puart_adapter->state & (HAL_UART_STATE_TX_BUSY | HAL_UART_STATE_DMATX_BUSY)) {
		DBG_UART_WARN("hal_uart_send: on Busy, State=%d\n", puart_adapter->state);
		return 0;
	}

	if ((ptx_buf == NULL) || (len == 0)) {
		puart_adapter->tx_status = HAL_UART_STATUS_ERR_PARA;
		DBG_UART_ERR("hal_uart_send: Err: ptx_buf=0x%x,  len=%d\n", ptx_buf, len);
		return 0;
	}

	uart_set_state(puart_adapter, HAL_UART_STATE_TX_BUSY);

	puart_adapter->tx_status = HAL_UART_STATUS_OK;
	if (timeout_ms > 0) {
		start_us = hal_read_cur_time();
	}

	while (tx_bytes < len) {
		if (puart->tflvr_b.tx_fifo_lv < Uart_Tx_FIFO_Size) {
			puart->thr = *((uint8_t *)(ptx_buf + tx_bytes));
			tx_bytes++;
		} else {
			// check timeout
			if ((timeout_ms > 0) && (timeout_ms != UART_WAIT_FOREVER)) {
				if (hal_is_timeout(start_us, timeout_ms * 1000)) {
					puart_adapter->tx_status = HAL_UART_STATUS_TIMEOUT;
					DBG_UART_WARN("hal_uart_send: Tx Timeout, TxCount=%d\n", tx_bytes);
					break;
				}
			} else if (timeout_ms == 0) {
				// No wait
				puart_adapter->tx_status = HAL_UART_STATUS_TIMEOUT;
				break;
			}
		}
	}

	if (tx_bytes == len) {
		// wait all data in TX FIFO be transmitted
		while (1) {
			lsr.w = puart->lsr;
			puart_adapter->lsr |= lsr.w & UART_LSR_ERR;
			if (lsr.b.txfifo_empty) {
				break;
			} else {
				if ((timeout_ms > 0) && (timeout_ms != UART_WAIT_FOREVER)) {
					if (hal_is_timeout(start_us, timeout_ms * 1000)) {
						puart_adapter->tx_status = HAL_UART_STATUS_TIMEOUT;
						break;
					}
				}
			}
		}
	}

	uart_clear_state(puart_adapter, HAL_UART_STATE_TX_BUSY);

	return tx_bytes;
}

/**
 *  @brief To send a block of data by interrupt mode.
 *         The TX FIFO will be refilled by the TX FIFO level low interrupt handler.
 *         This function returns with no waiting of the transmission done.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  ptx_buf  The buffer of data to be transmitted.
 *  @param[in]  len  The length of data in bytes to be send.
 *
 *  @return     HAL_OK: function execution OK.
 *  @return     HAL_BUSY: UART TX is in busy state, previous transmission is not finished yet.
 *  @return     HAL_ERR_PARA: Input arguments are invalid.
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_int_send(phal_uart_adapter_t puart_adapter, uint8_t *ptx_buf, uint32_t len)
{
	UART_Type *puart = puart_adapter->base_addr;
	uint32_t fifo_size;

	if (puart_adapter->state & (HAL_UART_STATE_TX_BUSY | HAL_UART_STATE_DMATX_BUSY)) {
		DBG_UART_WARN("HalRuartIntSendRtl8195a: on Busy, State=%d\n", puart_adapter->state);
		return HAL_BUSY;
	}

	if ((ptx_buf == NULL) || (len == 0)) {
		puart_adapter->tx_status = HAL_UART_STATUS_ERR_PARA;
		DBG_UART_ERR("hal_uart_int_send: Err: pTxData=0x%x,  Length=%d\n", ptx_buf, len);
		return HAL_ERR_PARA;
	}

	uart_set_state(puart_adapter, HAL_UART_STATE_TX_BUSY);

	puart_adapter->tx_status = HAL_UART_STATUS_OK;
	puart_adapter->ptx_buf = ptx_buf;
	puart_adapter->ptx_buf_sar = ptx_buf;
	puart_adapter->tx_count = len;

	fifo_size = Uart_Tx_FIFO_Size - puart->tflvr_b.tx_fifo_lv;
	if (fifo_size > puart_adapter->tx_count) {
		fifo_size = puart_adapter->tx_count;
	}

	for (; fifo_size > 0; fifo_size--) {
		puart->thr = *((uint8_t *)(puart_adapter->ptx_buf));
		puart_adapter->tx_count--;
		puart_adapter->ptx_buf++;
	}

	if (0 == puart_adapter->tx_count) {
		// Enable Tx FIFO empty interrupt for TX done callback
		puart->ier_b.etbei = 1;
	} else {
		// Disable Tx FIFO empty interrupt
		puart->ier_b.etbei = 0;
		// Enable Tx FIFO level low interrupt to trigger re-fill TX FIFO
		puart->vier_b.tx_fifo_lv_int_en = 1;
	}

	return HAL_OK;
}


/**
 *  @brief To send a block of data by the DMA transmission mode.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  ptx_buf  The buffer of data to be transmitted.
 *  @param[in]  len  The length of data in bytes to be transmitted.
 *
 *  @return     HAL_OK: function execution OK.
 *  @return     HAL_BUSY: UART TX is in busy state, previous transmission is not finished yet.
 *  @return     HAL_ERR_PARA: Input arguments are invalid.
 *  @return     HAL_NO_RESOURCE: Multiple-block DMA channel allocation failed.
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_dma_send(phal_uart_adapter_t puart_adapter, uint8_t *ptx_buf, uint32_t len)
{
	uint32_t block_size;
	hal_gdma_adaptor_t *pgdma_chnl = puart_adapter->ptx_gdma;

	if (puart_adapter->state & (HAL_UART_STATE_TX_BUSY | HAL_UART_STATE_DMATX_BUSY)) {
		DBG_UART_WARN("hal_uart_dma_send: on Busy, State=%d\n", puart_adapter->state);
		return HAL_BUSY;
	}

	if ((ptx_buf == NULL) || (len == 0) || (pgdma_chnl == NULL)) {
		puart_adapter->tx_status = HAL_UART_STATUS_ERR_PARA;
		DBG_UART_ERR("hal_uart_dma_send: Err: pTxData=0x%x,  Length=%d GDMA_Chnl=0x%x\n", ptx_buf, len, pgdma_chnl);
		return HAL_ERR_PARA;
	}

	if (((len & 0x03) == 0) && (((uint32_t)(ptx_buf) & 0x03) == 0) &&
		(puart_adapter->tx_dma_width_1byte == 0)) {
		// 4-bytes aligned, move 4 bytes each transfer
		block_size = len >> 2;
	} else {
		block_size = len;
	}

