swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
	uart_set_state(puart_adapter, HAL_UART_STATE_DMATX_BUSY);

	puart_adapter->tx_status = HAL_UART_STATUS_OK;
	puart_adapter->ptx_buf = ptx_buf;
	puart_adapter->ptx_buf_sar = ptx_buf;
	puart_adapter->tx_count = len;

	pgdma_chnl->ch_sar = (uint32_t) ptx_buf;
	if (block_size == len) {
		// move 1 byte each transfer
		pgdma_chnl->gdma_ctl.src_msize   = MsizeFour;
		pgdma_chnl->gdma_ctl.src_tr_width = TrWidthOneByte;
		pgdma_chnl->gdma_ctl.block_size = len;
	} else {
		// 4-bytes aligned, move 4 bytes each transfer
		pgdma_chnl->gdma_ctl.src_msize   = MsizeOne;
		pgdma_chnl->gdma_ctl.src_tr_width = TrWidthFourBytes;
		pgdma_chnl->gdma_ctl.block_size = len >> 2;
	}
	pgdma_chnl->gdma_ctl.dest_msize  = MsizeFour;
	pgdma_chnl->gdma_ctl.dst_tr_width = TrWidthOneByte;

	if (puart_adapter->dcache_clean_by_addr != NULL) {
		puart_adapter->dcache_clean_by_addr((uint32_t *)ptx_buf, (int32_t)len);
	}
	if (block_size <= MAX_DMA_BLOCK_SIZE) {
		puart_adapter->base_addr->miscr_b.txdma_en = 1; // Enable UART TX DMA
		hal_rtl_gdma_transfer_start(pgdma_chnl, MultiBlkDis);
	} else if (block_size <= MAX_DMA_BLOCK_SIZE * 32) {
		// Need to use multiple block DMA
		if (pgdma_chnl->ch_num < 4) {
			// Current GDMA Channel didn't support multiple block DMA, re-allocate another one
			uart_clear_state(puart_adapter, HAL_UART_STATE_DMATX_BUSY);
			DBG_UART_ERR("hal_uart_dma_send: Err! TX %u Blk, Current DMA Chnl not support Multi-Blk\r\n", block_size);
			return HAL_NO_RESOURCE;
		}

		puart_adapter->base_addr->miscr_b.txdma_en = 1; // Enable UART TX DMA
		hal_rtl_gdma_transfer_start(pgdma_chnl, MultiBlkEn);
	} else {
		uart_clear_state(puart_adapter, HAL_UART_STATE_DMATX_BUSY);
		DBG_UART_ERR("hal_uart_dma_send: Err: TX length too big(%lu)\r\n", len);
		return HAL_ERR_PARA;
	}

	return HAL_OK;
}

/**
 *  @brief To stop and skip current on going interrupt mode or
 *         DMA mode data transmission.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *
 *  @returns The length of data, in byte, has been transmitted.
 *           Return 0 for the case of there is no on going data transmittion.
 */
SECTION_UART_TEXT
uint32_t hal_rtl_uart_send_abort(phal_uart_adapter_t puart_adapter)
{
	UART_Type *puart = puart_adapter->base_addr;
	BOOLEAN dma_tx = 0;
	uint32_t dma_tx_bytes = 0;
	hal_gdma_adaptor_t *ptx_gdma;

	if ((puart_adapter->state & (HAL_UART_STATE_TX_BUSY | HAL_UART_STATE_DMATX_BUSY)) == 0) {
		DBG_UART_INFO("hal_uart_send_abort: Not in TX state, State=%d\n", puart_adapter->state);
		return 0;
	}

	// Disable Tx FIFO empty interrupt
	puart->ier_b.etbei = 0;
	puart->vier_b.tx_fifo_lv_int_en = 0;
	if ((puart_adapter->state & HAL_UART_STATE_DMATX_BUSY) != 0) {
		dma_tx = 1;
	}

	if (dma_tx) {
		puart_adapter->base_addr->miscr_b.txdma_en = 0; // Disable UART TX DMA
		ptx_gdma = puart_adapter->ptx_gdma;
		hal_rtl_gdma_abort(ptx_gdma);
#if 0
		dma_tx_bytes = ptx_gdma->abort_recv_byte;
#else
		dma_tx_bytes = hal_rtl_gdma_query_send_bytes(ptx_gdma);
#endif
		DBG_UART_INFO("dma_tx_bytes: %lu\r\n", dma_tx_bytes);

		if (dma_tx_bytes > puart_adapter->tx_count) {
			DBG_UART_WARN("hal_uart_send_abort: DMA TXed bytes(%lu) over expected(%lu)\n", \
						  dma_tx_bytes, puart_adapter->tx_count);
			dma_tx_bytes = puart_adapter->tx_count;
		}
		puart_adapter->ptx_buf += dma_tx_bytes;
		puart_adapter->tx_count -= dma_tx_bytes;
	}

	uart_clear_state(puart_adapter, (HAL_UART_STATE_TX_BUSY | HAL_UART_STATE_DMATX_BUSY));

	return (uint32_t)puart_adapter->ptx_buf - (uint32_t)puart_adapter->ptx_buf_sar;
}

/**
 *  @brief To check if any data is ready in the RX FIFO.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *
 *  @return     TRUE    at least 1 byte of data is ready in the RX FIFO.
 *  @return     FALSE   no data in the RX FIFO.
 */
SECTION_UART_TEXT
BOOL hal_rtl_uart_readable(phal_uart_adapter_t puart_adapter)
{
	UART_Type *puart = puart_adapter->base_addr;

	if (puart->rflvr_b.rx_fifo_lv > 0) {
		return TRUE;
	} else {
		return FALSE;
	}
}

/**
 *  @brief To read a byte of data from the RX FIFO.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *
 *  @returns    The the received data.
 */
SECTION_UART_TEXT
char hal_rtl_uart_getc(phal_uart_adapter_t puart_adapter)
{
	return (puart_adapter->base_addr->rbr_b.rxdata);
}

/**
 *  @brief To check if any data is ready in RX FIFO and read 1
 *         byte of data if data is available.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[out] data  The gotten character.
 *
 *  @return     TRUE    read RX FIFO OK.
 *  @return     FALSE   no data in the RX FIFO.
 */
SECTION_UART_TEXT
int hal_rtl_uart_rgetc(phal_uart_adapter_t puart_adapter, char *data)
{
	UART_Type *puart = puart_adapter->base_addr;

	if (puart->rflvr_b.rx_fifo_lv > 0) {
		*data = (char)puart->rbr;
		return TRUE;
	} else {
		return FALSE;
	}
}

/**
 *  @brief To receives a block of data by the polling mode.
 *
 *  @param[in]   puart_adapter  The UART adapter.
 *  @param[out]  prx_buf  The buffer for the data receiving.
 *  @param[in]   len  The length of data in byte to be received.
 *  @param[in]   timeout_ms  The maximum period(in ms) for the waiting of data receiving.
 *
 *  @returns     The length, in byte, of data has been received. Return 0 for the case of
 *               UART RX state is busy (previous receiving not didn't finished yet)
 */
SECTION_UART_TEXT
uint32_t hal_rtl_uart_recv(phal_uart_adapter_t puart_adapter, uint8_t *prx_buf, uint32_t len, uint32_t timeout_ms)
{
	UART_Type *puart = puart_adapter->base_addr;
	uint32_t rx_bytes = 0;
	uint32_t start_us = 0;
	volatile uint32_t bytes_in_fifo = 0;

	if (puart_adapter->state & (HAL_UART_STATE_RX_BUSY | HAL_UART_STATE_DMARX_BUSY)) {
		DBG_UART_WARN("hal_uart_recv: on Busy, State=%d\n", puart_adapter->state);
		return 0;
	}

	if ((prx_buf == NULL) || (len == 0)) {
		puart_adapter->rx_status = HAL_UART_STATUS_ERR_PARA;
		DBG_UART_ERR("hal_uart_recv: Err: prx_buf=0x%x, len=%d\n", prx_buf, len);
		return 0;
	}

	uart_set_state(puart_adapter, HAL_UART_STATE_RX_BUSY);

