swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
	puart_adapter->rx_status = HAL_UART_STATUS_OK;

	if (timeout_ms > 0) {
		start_us = hal_read_cur_time();
	}

	while (len > 0) {
		bytes_in_fifo = puart->rflvr_b.rx_fifo_lv;
		if (bytes_in_fifo > 0) {
			if (bytes_in_fifo > len) {
				bytes_in_fifo = len;
			}

			// update LSR by interupt
			for (; bytes_in_fifo > 0; bytes_in_fifo--) {
				*(prx_buf) = (uint8_t)puart->rbr;
				prx_buf++;
				len--;
				rx_bytes++;
			}
		} else {
			// check timeout
			if ((timeout_ms > 0) && (timeout_ms != UART_WAIT_FOREVER)) {
				if (hal_is_timeout(start_us, timeout_ms * 1000)) {
					puart_adapter->rx_status = HAL_UART_STATUS_TIMEOUT;
					DBG_UART_WARN("hal_uart_recv: Rx Timeout, RxCount=%d\n", rx_bytes);
					break;
				}
			} else if (timeout_ms == 0) {
				// No wait
				puart_adapter->rx_status = HAL_UART_STATUS_TIMEOUT;
				break;
			}
		}
	}

	uart_clear_state(puart_adapter, HAL_UART_STATE_RX_BUSY);

	return rx_bytes;
}

/**
 *  @brief To receive a block of data by the interrupt mode.
 *         It read the RX FIFO in the RX FIFO level interrupr handler.
 *         This function returns without waiting of data receiving done.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[out] prx_buf The buffer for the data receiving.
 *  @param[in]  len  The length of data, in byte, are going to receive.
 *
 *  @return     HAL_OK: function execution OK.
 *  @return     HAL_BUSY: UART RX is in busy state, previous receiving is not finished yet.
 *  @return     HAL_ERR_PARA: Input arguments are invalid.
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_int_recv(phal_uart_adapter_t puart_adapter, uint8_t *prx_buf, uint32_t len)
{
	UART_Type *puart = puart_adapter->base_addr;
	uint32_t bytes_in_fifo = 0;

	if (puart_adapter->state & (HAL_UART_STATE_RX_BUSY | HAL_UART_STATE_DMARX_BUSY)) {
		DBG_UART_WARN("hal_uart_int_recv: on Busy, State=%d\n", puart_adapter->state);
		return HAL_BUSY;
	}

	if ((prx_buf == NULL) || (len == 0)) {
		puart_adapter->rx_status = HAL_UART_STATUS_ERR_PARA;
		DBG_UART_ERR("hal_uart_int_recv: Err: prx_buf=0x%x, len=%u\n", prx_buf, len);
		return HAL_ERR_PARA;
	}

	uart_set_state(puart_adapter, HAL_UART_STATE_RX_BUSY);

	puart_adapter->rx_status = HAL_UART_STATUS_OK;
	puart_adapter->prx_buf = prx_buf;
	puart_adapter->prx_buf_dar = prx_buf;
	puart_adapter->rx_count = len;

	// Could be the RX FIFO has some data already
	bytes_in_fifo = puart->rflvr;
	if (bytes_in_fifo > 0) {
		if (bytes_in_fifo > len) {
			bytes_in_fifo = len;
		}

		// update LSR by interrupt
		for (; bytes_in_fifo > 0; bytes_in_fifo--) {
			*(puart_adapter->prx_buf) = (uint8_t)puart->rbr;
			puart_adapter->rx_count--;
			puart_adapter->prx_buf++;
		}
	}

	if (puart_adapter->rx_count == 0) {
		uart_clear_state(puart_adapter, HAL_UART_STATE_RX_BUSY);

		// Call User Rx complete callback
		if (puart_adapter->rx_done_callback != NULL) {
			puart_adapter->rx_done_callback(puart_adapter->rx_done_cb_para);
		}
	} else {
		// Enable RX trigger Interrupt: data ready and line status changed(RX error)
		puart->ier_b.erbi = 1;
	}

	return HAL_OK;
}

/**
 *  @brief To receive a block of data by the DMA mode.
 *         This function returns without waiting of data receiving done.
 *
 *  @param[in]  puart_adapter The UART adapter.
 *  @param[out] prx_buf The buffer for the data receiving.
 *  @param[in]  len  The length of data, in byte, are going to receive.
 *
 *  @return     HAL_OK: function execution OK.
 *  @return     HAL_BUSY: UART RX is in busy state, previous receiving is not finished yet.
 *  @return     HAL_ERR_PARA: Input arguments are invalid.
 *  @return     HAL_NO_RESOURCE: Multiple-block DMA channel allocation failed.
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_dma_recv(phal_uart_adapter_t puart_adapter, uint8_t *prx_buf, uint32_t len)
{
	hal_gdma_adaptor_t *pgdma_chnl = puart_adapter->prx_gdma;

	if (puart_adapter->state & (HAL_UART_STATE_RX_BUSY | HAL_UART_STATE_DMARX_BUSY)) {
		DBG_UART_WARN("hal_uart_dma_recv: on Busy, State=%d\n", puart_adapter->state);
		return HAL_BUSY;
	}

	if ((prx_buf == NULL) || (len == 0) || (pgdma_chnl == NULL)) {
		puart_adapter->rx_status = HAL_UART_STATUS_ERR_PARA;
		DBG_UART_ERR("hal_uart_dma_recv: Err: prx_buf=0x%x, len=%u, GDMA_Chnl=0x%x\n", prx_buf, len, pgdma_chnl);
		return HAL_ERR_PARA;
	}

	uart_set_state(puart_adapter, HAL_UART_STATE_DMARX_BUSY);
	puart_adapter->rx_status = HAL_UART_STATUS_OK;
	puart_adapter->prx_buf = prx_buf;
	puart_adapter->prx_buf_dar = prx_buf;
	puart_adapter->rx_count = len;

	pgdma_chnl->ch_dar = (uint32_t) prx_buf;
	pgdma_chnl->gdma_ctl.src_msize   = MsizeFour;
	pgdma_chnl->gdma_ctl.src_tr_width = TrWidthOneByte;
	pgdma_chnl->gdma_ctl.block_size = len;



//    if (((len & 0x03) == 0) && (((uint32_t)(prx_buf) & 0x03) == 0)) {
	if ((len >= 4) && (puart_adapter->rx_dma_width_1byte == 0)) {
		// 4-bytes aligned, move 4 bytes each transfer
		pgdma_chnl->gdma_ctl.dest_msize  = MsizeOne;
		pgdma_chnl->gdma_ctl.dst_tr_width = TrWidthFourBytes;
	} else {
		// move 1 byte each transfer
		pgdma_chnl->gdma_ctl.dest_msize  = MsizeFour;
		pgdma_chnl->gdma_ctl.dst_tr_width = TrWidthOneByte;
	}

	if (len <= MAX_DMA_BLOCK_SIZE) {
		puart_adapter->base_addr->miscr_b.rxdma_en = 1; // Enable UART RX DMA
		hal_rtl_gdma_transfer_start(pgdma_chnl, MultiBlkDis);
	} else if (len <= MAX_DMA_BLOCK_SIZE * 32) {
		// Need to use multiple block DMA
		if (pgdma_chnl->ch_num < 4) {
			// Current GDMA Channel didn't support multiple block DMA, re-allocate another one
			uart_clear_state(puart_adapter, HAL_UART_STATE_DMARX_BUSY);
			DBG_UART_ERR("hal_uart_dma_recv: Err! RX %u, Current DMA Chnl not support Multi-Blk!\r\n", len);
			return HAL_NO_RESOURCE;
		}

		puart_adapter->base_addr->miscr_b.rxdma_en = 1; // Enable UART RX DMA
		hal_rtl_gdma_transfer_start(pgdma_chnl, MultiBlkEn);
	} else {
		uart_clear_state(puart_adapter, HAL_UART_STATE_DMARX_BUSY);
		DBG_UART_ERR("hal_uart_dma_recv: Err: RX Len(%lu) too big\n", len);
		return HAL_ERR_PARA;
	}

	return HAL_OK;
}

/**
 *  @brief To abort an on going UART RX transfer.
 *
 *  @param[in]  puart_adapter The UART adapter.
 *
 *  @return     value 0  There is no on going UART data receiving.
 *  @return     value > 0  The data length, in byte, has been received.
 */
SECTION_UART_TEXT
uint32_t hal_rtl_uart_recv_abort(phal_uart_adapter_t puart_adapter)
{
//    PUART_DMA_CONFIG pUartGdmaConfig;
	UART_Type *puart = puart_adapter->base_addr;
	uint32_t dma_rx_bytes;
	uint32_t bytes_in_fifo;
	BOOLEAN dma_rx = 0;
	hal_gdma_adaptor_t *prx_gdma;

	if ((puart_adapter->state & (HAL_UART_STATE_RX_BUSY | HAL_UART_STATE_DMARX_BUSY)) == 0) {
		DBG_UART_INFO("hal_uart_recv_abort: Not in RX state, State=%d\n",  puart_adapter->state);
		return 0;
	}

	if ((puart_adapter->state & HAL_UART_STATE_DMARX_BUSY) != 0) {
		dma_rx = 1;
	}

	// Disable Rx interrupt
	if (puart_adapter->rx_dr_callback == NULL) {
		puart->ier_b.erbi = 0;
	}

	// TODO: DMA RX Abort
	if (dma_rx) {
		puart_adapter->base_addr->miscr_b.rxdma_en = 0; // Disable UART RX DMA
		prx_gdma = puart_adapter->prx_gdma;
		hal_rtl_gdma_abort(prx_gdma);
#if 0
		dma_rx_bytes = prx_gdma->abort_recv_byte;
#else
		dma_rx_bytes = hal_rtl_gdma_query_recv_bytes(prx_gdma);
#endif

		if (dma_rx_bytes > puart_adapter->rx_count) {
			DBG_UART_WARN("hal_uart_recv_abort: DMA RXed bytes(%lu) over expected(%lu)\n", \
						  dma_rx_bytes, puart_adapter->rx_count);
			dma_rx_bytes = puart_adapter->rx_count;
		}
		// D-Cache sync (Invalidate)
		if (puart_adapter->dcache_invalidate_by_addr != NULL) {
			puart_adapter->dcache_invalidate_by_addr((uint32_t *)puart_adapter->prx_buf_dar, (int32_t)dma_rx_bytes);
		}

