swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
		puart_adapter->prx_buf += dma_rx_bytes;
		puart_adapter->rx_count -= dma_rx_bytes;

		if (puart_adapter->rx_count > 0) {
			bytes_in_fifo = puart->rflvr;
			if (bytes_in_fifo > 0) {
				if (bytes_in_fifo > puart_adapter->rx_count) {
					bytes_in_fifo = puart_adapter->rx_count;
				}

				// update LSR by interupt
				for (; bytes_in_fifo > 0; bytes_in_fifo--) {
					*(puart_adapter->prx_buf) = (uint8_t)puart->rbr;
					puart_adapter->rx_count--;
					puart_adapter->prx_buf++;
				}
			}
		}
	}

	uart_clear_state(puart_adapter, (HAL_UART_STATE_RX_BUSY | HAL_UART_STATE_DMARX_BUSY));

	return ((uint32_t)puart_adapter->prx_buf - (uint32_t)puart_adapter->prx_buf_dar);
}

/**
 *  @brief Query the UART index by a given pin name and a pin map table.
 *
 *  @param[in]  pin_name  The pin name be used to query the corresponding UART index.
 *  @param[in]  pin_map  The pin map table.
 *
 *  @returns    The UART index. If the given pin name didn't map to a valid UART, the return value is 0xFF.
 */
SECTION_UART_TEXT
uint8_t _hal_uart_pin_to_idx(uint32_t pin_name, phal_pin_map pin_map)
{
	uint8_t uart_idx;

	uart_idx = 0xFF;
	while (pin_map->pin_name != 0xFF) {
		if (pin_name == pin_map->pin_name) {
			uart_idx = pin_map->peripheral_id - PID_UART0;
			break;
		} else {
			pin_map++;
		}
	}

	return uart_idx;
}

/**
 *  @brief Query the UART index by a given pin name and its pin function.
 *
 *  @param[in]  pin_name  The pin name be used to query the corresponding UART index.
 *  @param[in]  pin_type  The function type of the pin.
 *
 *  @returns    The UART index. If the given pin name didn't map to a valid UART, the return value is 0xFF.
 */
SECTION_UART_TEXT
uint8_t hal_rtl_uart_pin_to_idx(uint32_t pin_name, uart_pin_func_t pin_type)
{
	phal_pin_map pmap_tbl;

	switch (pin_type) {
	case UART_Pin_TX:
		pmap_tbl = (phal_pin_map)&uart_tx_pin_map[0];
		break;

	case UART_Pin_RX:
		pmap_tbl = (phal_pin_map)&uart_rx_pin_map[0];
		break;

	case UART_Pin_RTS:
		pmap_tbl = (phal_pin_map)&uart_rts_pin_map[0];
		break;

	case UART_Pin_CTS:
		pmap_tbl = (phal_pin_map)&uart_cts_pin_map[0];
		break;

	default:
		// invalid pin type
		return 0xFF;
	}

	return _hal_uart_pin_to_idx(pin_name, pmap_tbl);
}

/**
 *  @brief Query the UART index by a given pin name of an UART RX pin.
 *
 *  @param[in]  pin_name  The pin name be used to query the corresponding UART index.
 *
 *  @returns    The UART index. If the given pin name didn't map to a valid UART, the return value is 0xFF.
 */
SECTION_UART_TEXT
uint8_t hal_rtl_uart_rx_pin_to_idx(uint32_t pin_name)
{
	return _hal_uart_pin_to_idx(pin_name, (phal_pin_map)&uart_rx_pin_map[0]);
}

/**
 *  @brief Query the UART index by a given pin name of an UART TX pin.
 *
 *  @param[in]  pin_name  The pin name be used to query the corresponding UART index.
 *
 *  @returns    The UART index. If the given pin name didn't map to a valid UART, the return value is 0xFF.
 */
SECTION_UART_TEXT
uint8_t hal_rtl_uart_tx_pin_to_idx(uint32_t pin_name)
{
	return _hal_uart_pin_to_idx(pin_name, (phal_pin_map)&uart_tx_pin_map[0]);
}

/**
 *  @brief Query the UART index by a given pin name of an UART RTS pin.
 *
 *  @param[in]  pin_name  The pin name be used to query the corresponding UART index.
 *
 *  @returns    The UART index. If the given pin name didn't map to a valid UART, the return value is 0xFF.
 */
SECTION_UART_TEXT
uint8_t hal_rtl_uart_rts_pin_to_idx(uint32_t pin_name)
{
	return _hal_uart_pin_to_idx(pin_name, (phal_pin_map)&uart_rts_pin_map[0]);
}

/**
 *  @brief Query the UART index by a given pin name of an UART CTS pin.
 *
 *  @param[in]  pin_name  The pin name be used to query the corresponding UART index.
 *
 *  @returns    The UART index. If the given pin name didn't map to a valid UART, the return value is 0xFF.
 */
SECTION_UART_TEXT
uint8_t hal_rtl_uart_cts_pin_to_idx(uint32_t pin_name)
{
	return _hal_uart_pin_to_idx(pin_name, (phal_pin_map)&uart_cts_pin_map[0]);
}

/**
 *  @brief Init default UART register state.
 *
 *  @param[in]  puart_adapter   The UART adapter.
 *  @param[in]  pconfig  The extra UART port setting for the initial configuration.
 *                       This is an UART adapter initial value. If this value is not NULL,
 *                       the initialization function will initial the new UART adapter by
 *                       this initial value. And also will do further configure, configures
 *                       the bard rate, hardware flow control and the frame format.
 *  @return     HAL_OK: UART set    default state OK!
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_set_default_state(phal_uart_adapter_t puart_adapter, phal_uart_defconfig_t pconfig)
{

	/* Get UART reg type*/
	UART_Type *puart = puart_adapter->base_addr;
	hal_status_t ret = HAL_OK;

	/* Reset RX FIFO */
	hal_rtl_uart_reset_rx_fifo(puart_adapter);

	/* Disable all interrupts */
	puart->ier = 0;
//    puart->ier_b.elsi = 1;  // always enable line status error interrupt

	/* clear vendor interrupt status */
	puart->visr = 0xFF; // clear all
	puart->vier = 0; // disable all

	/* Set Baudrate Division */
	if ((!puart_adapter->is_inited) && (pconfig != NULL)) {
		hal_rtl_uart_set_format(puart_adapter, puart_adapter->word_len,
								puart_adapter->parity_type, puart_adapter->stop_bit);
		hal_rtl_uart_set_baudrate(puart_adapter, puart_adapter->baudrate);
		/* Configure FlowControl */
		ret = hal_rtl_uart_set_flow_control(puart_adapter, puart_adapter->flow_ctrl);
	}

	/**
	  * Clean Rx break signal interrupt status at initial stage.
	  */
	puart->scr_b.rx_break_int_sts = 1;

	/* Need to assert RTS during initial stage. */
	hal_rtl_uart_set_rts(puart_adapter, 1);

	return ret;
}

/**
 *  @brief Select low-power UART SCLK, and setting default baud-rate table.
 *
 *  @param[in]  puart_adapter   The UART adapter.
 *  @param[in]  sclk_sel   The low-power UART SCLK source.
 *
 *  @return     HAL_ERR_PARA:  Input UART ID are invalid.
 *  @return     HAL_OK: Low-power UART SCLK select OK!
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_lp_sclk_select(phal_uart_adapter_t puart_adapter, uint8_t sclk_sel)
{

	hal_status_t ret = HAL_OK;

#if !defined(CONFIG_BUILD_NONSECURE)
	AON_TypeDef *aon_obj = AON;

