swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
	if (Uart0 != puart_adapter->uart_idx) {
		DBG_UART_ERR("%s: UART%d can not select SCLK\r\n", __func__, puart_adapter->uart_idx);
		return HAL_ERR_PARA;
	}

	/* Disable func/bus/pclk/sclk */
	hal_rtl_uart_en_ctrl(puart_adapter->uart_idx, OFF);

	switch (sclk_sel) {
	case UART_IRC_4M:
		puart_adapter->pdef_ovsr_tbl = def_ovsr_4m;
		puart_adapter->pdef_div_tbl = def_div_4m;
		puart_adapter->pdef_ovsradjbit_tbl10 = def_ovsr_adj_bit_10b_4m;
		puart_adapter->pdef_ovsradjbit_tbl9 = def_ovsr_adj_bit_9b_4m;
		puart_adapter->pdef_ovsradjbit_tbl8 = def_ovsr_adj_bit_8b_4m;
		puart_adapter->uart_sclk = UartSCLK_4M;
		hal_rtl_sys_set_clk(UART0_SYS, UART_IRC_4M);
		break;

	case UART_XTAL:
		if (0x0 == aon_obj->AON_REG_AON_OTP_SYSCFG5) {
			//Xtal = 40MHz
			puart_adapter->pdef_ovsr_tbl = def_ovsr_40m;
			puart_adapter->pdef_div_tbl = def_div_40m;
			puart_adapter->pdef_ovsradjbit_tbl10 = def_ovsr_adj_bit_10b_40m;
			puart_adapter->pdef_ovsradjbit_tbl9 = def_ovsr_adj_bit_9b_40m;
			puart_adapter->pdef_ovsradjbit_tbl8 = def_ovsr_adj_bit_8b_40m;
			puart_adapter->uart_sclk = UartSCLK_40M;
		} else if (0x5 == aon_obj->AON_REG_AON_OTP_SYSCFG5) {
			//Xtal = 26MHz
			puart_adapter->pdef_ovsr_tbl = def_ovsr_26m;
			puart_adapter->pdef_div_tbl = def_div_26m;
			puart_adapter->pdef_ovsradjbit_tbl10 = def_ovsr_adj_bit_10b_26m;
			puart_adapter->pdef_ovsradjbit_tbl9 = def_ovsr_adj_bit_9b_26m;
			puart_adapter->pdef_ovsradjbit_tbl8 = def_ovsr_adj_bit_8b_26m;
			puart_adapter->uart_sclk = UartSCLK_26M;
		}
		hal_rtl_sys_set_clk(UART0_SYS, UART_XTAL);
		break;

	case UART_PERI_40M:
	default:
		puart_adapter->pdef_ovsr_tbl = def_ovsr_40m;
		puart_adapter->pdef_div_tbl = def_div_40m;
		puart_adapter->pdef_ovsradjbit_tbl10 = def_ovsr_adj_bit_10b_40m;
		puart_adapter->pdef_ovsradjbit_tbl9 = def_ovsr_adj_bit_9b_40m;
		puart_adapter->pdef_ovsradjbit_tbl8 = def_ovsr_adj_bit_8b_40m;
		puart_adapter->uart_sclk = UartSCLK_40M;
		hal_rtl_sys_set_clk(UART0_SYS, UART_PERI_40M);
		break;
	}

	/* Enable func/bus/pclk/sclk */
	hal_rtl_uart_en_ctrl(puart_adapter->uart_idx, ON);

	/*  Set UART register default state*/
	hal_rtl_uart_set_default_state(puart_adapter, NULL);

	DBG_UART_INFO("%s: UART%d SCLK= %d\r\n", __func__, puart_adapter->uart_idx, puart_adapter->uart_sclk);
#else
	ret = HAL_NO_RESOURCE;
#endif
	return ret;
}

SECTION_UART_TEXT
hal_status_t hal_rtl_uart_load_default_state(phal_uart_adapter_t puart_adapter, phal_uart_defconfig_t pconfig)
{

	hal_status_t ret = HAL_OK;
	/*  Set UART register default state*/
	ret = hal_rtl_uart_set_default_state(puart_adapter, pconfig);

	puart_adapter->state = 0;
	puart_adapter->is_inited = 1;
	return ret;
}


/**
 *  @brief To initial a UART port adapter. This function must be called before any UART port
 *         operation. This function will do:
 *           - enable the UART hardware.
 *           - register the interrupt handler.
 *           - configures the pin mux.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  uart_idx The UART index. The value can be 0 .. 2.
 *  @param[in]  pin_sel  The pin mux selection.
 *  @param[in]  pconfig  The extra UART port setting for the initial configuration.
 *                       This is an UART adapter initial value. If this value is not NULL,
 *                       the initialization function will initial the new UART adapter by
 *                       this initial value. And also will do further configure, configures
 *                       the bard rate, hardware flow control and the frame format.
 *
 *  @return     HAL_ERR_PARA:  Input arguments are invalid.
 *  @return     HAL_OK:  UART port initialization OK.
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_init(phal_uart_adapter_t puart_adapter, uint32_t tx_pin, uint32_t rx_pin,
							   phal_uart_defconfig_t pconfig)
{
	/* Get UART reg type*/
	UART_Type *puart;
	hal_status_t ret = HAL_OK;
	uint8_t uart_idx = 0xFF;

	/* Set UART ID*/
	if (tx_pin != PIN_NC) {
		uart_idx = hal_rtl_uart_pin_to_idx(tx_pin, UART_Pin_TX);
		if (uart_idx >= MAX_UART_PORT) {
			DBG_UART_ERR("%s: pin(0x%x) is not for UART TX\r\n", __func__, tx_pin);
			return HAL_ERR_PARA;
		}
	}

	if (rx_pin != PIN_NC) {
		if (uart_idx != 0xFF) {
			if (uart_idx != hal_rtl_uart_pin_to_idx(rx_pin, UART_Pin_RX)) {
				DBG_UART_ERR("%s:tx_pin(0x%x) & rx_pin(0x%x) is not on the same UART\r\n", __func__, tx_pin, rx_pin);
				return HAL_ERR_PARA;
			}
		} else {
			uart_idx = hal_rtl_uart_pin_to_idx(rx_pin, UART_Pin_RX);
			if (uart_idx >= MAX_UART_PORT) {
				DBG_UART_ERR("%s: pin(0x%x) is not for UART RX\r\n", __func__, rx_pin);
				return HAL_ERR_PARA;
			}
		}
	}

	DBG_UART_INFO("hal_uart_init: UART%u\r\n", uart_idx);
	if (uart_idx >= MaxUartNum) {
		return HAL_ERR_PARA;
	}

	hal_rtl_uart_adapter_init(puart_adapter, (uint8_t)uart_idx, pconfig);
	puart_adapter->tx_pin = tx_pin;
	puart_adapter->rx_pin = rx_pin;
	puart_adapter->rts_pin = PIN_NC;
	puart_adapter->cts_pin = PIN_NC;

	puart = puart_adapter->base_addr;
	if (puart == (UART_Type *)0) {
		// error: the adapter did not initial yet!!
		return HAL_ERR_PARA;
	}

	/* Register UART IRQ handler*/
	hal_rtl_uart_reg_irq(puart_adapter, (irq_handler_t)_uart_irq_handler);

#if !defined(CONFIG_BUILD_NONSECURE)
	if (Uart0 == puart_adapter->uart_idx) {
		//UART0 default SCLK= 40MHz
		hal_rtl_sys_set_clk(UART0_SYS, UART_PERI_40M);
	}
	/* Enable func/bus/pclk/sclk */
	hal_rtl_uart_en_ctrl(puart_adapter->uart_idx, ON);
	hal_rtl_uart_load_default_state(puart_adapter, pconfig);
#else
	ret = HAL_NOT_READY;
#endif
	return ret;
}

/**
 *  @brief To initial a GDMA channel for the UART TX DMA mode transfer.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  pgdma_chnl The GDMA channel adapter. It is use to control
 *              the GDMA channel transfer.
 *
 *  @return     HAL_ERR_PARA:  Input arguments are invalid.
 *  @return     HAL_OK:  GDMA channel initialization OK.
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_tx_gdma_init(phal_uart_adapter_t puart_adapter, phal_gdma_adaptor_t pgdma_chnl)
{
	uint32_t dst_per = 0;

