swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
	if ((NULL == puart_adapter) || (NULL == pgdma_chnl)) {
		DBG_UART_ERR("hal_uart_tx_gdma_init: puart_adapter=0x%x pgdma_chnl=0x%x\n", puart_adapter, pgdma_chnl);
		return HAL_ERR_PARA;
	}

//    _memset((void *)pgdma_chnl, 0, sizeof(hal_gdma_adaptor_t));

	// set burst size: how many space in TX FIFO will trigger DMA req
	if (puart_adapter->tx_dma_burst_size == 0) {
		// didn't assign the TX DMA burst size, use TX FIFO trigger level to configure the TX burst size
		if (puart_adapter->base_addr->stsr_b.txfifo_low_level_status == 0) {
			puart_adapter->tx_dma_burst_size = Uart_Tx_FIFO_Size - 4;
		} else {
			puart_adapter->tx_dma_burst_size = Uart_Tx_FIFO_Size - 8;
		}
	}
	puart_adapter->base_addr->miscr_b.txdma_burstsize = puart_adapter->tx_dma_burst_size;
	puart_adapter->base_addr->fcr_b.dma_mode = 1;
	puart_adapter->base_addr->miscr_b.txdma_en = 0; // disable TX DMA at initial

	if (puart_adapter->uart_idx > Uart4) {
		DBG_UART_ERR("hal_uart_tx_gdma_init: Invalid UART Idx(%u), didn't initial? \r\n", puart_adapter->uart_idx);
		return HAL_ERR_PARA;
	}
	dst_per = uart_tx_gdma_hsk_id_tbl[puart_adapter->uart_idx];

	pgdma_chnl->gdma_ctl.tt_fc      = TTFCMemToPeri;
	//pgdma_chnl->gdma_cfg.reload_dst = 1;
	pgdma_chnl->gdma_cfg.dest_per   = (u8)dst_per;
	pgdma_chnl->ch_dar = (u32) & (puart_adapter->base_addr->thr);
	pgdma_chnl->gdma_isr_type = (TransferType | ErrType);
	pgdma_chnl->gdma_ctl.int_en      = 1;
	pgdma_chnl->gdma_ctl.dinc = NoChange;
	pgdma_chnl->gdma_ctl.sinc = IncType;
	pgdma_chnl->have_chnl = 0;

	hal_rtl_gdma_handshake_init(pgdma_chnl, (uint8_t)dst_per);
	hal_rtl_gdma_irq_reg(pgdma_chnl, (irq_handler_t)_uart_tx_dma_irq_handler, puart_adapter);
	puart_adapter->ptx_gdma = pgdma_chnl;
	return HAL_OK;
}

/**
 *  @brief To de-initial the UART TX GDMA channel.
 *         Also will disable the UART TX DMA transfer mode.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *
 *  @return     HAL_ERR_PARA:  Input arguments are invalid.
 *  @return     HAL_OK:  GDMA channel de-initialization OK.
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_tx_gdma_deinit(phal_uart_adapter_t puart_adapter)
{
	if (NULL == puart_adapter) {
		DBG_UART_ERR("hal_uart_tx_gdma_deinit: puart_adapter = NULL\n");
		return HAL_ERR_PARA;
	}

	if (NULL == puart_adapter->ptx_gdma) {
		DBG_UART_ERR("hal_uart_tx_gdma_deinit: ptx_gdma = NULL\n");
		return HAL_ERR_PARA;
	}

	puart_adapter->ptx_gdma = NULL;
	puart_adapter->base_addr->miscr_b.txdma_en = 0; // disable TX DMA at initial

	return HAL_OK;
}

/**
 *  @brief To initial a GDMA channel for the UART RX DMA mode transfer.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  pgdma_chnl The GDMA channel adapter. It is use to control
 *              the GDMA channel transfer.
 *
 *  @return     HAL_ERR_PARA:  Input arguments are invalid.
 *  @return     HAL_OK:  GDMA channel initialization OK.
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_rx_gdma_init(phal_uart_adapter_t puart_adapter, phal_gdma_adaptor_t pgdma_chnl)
{
	uint32_t src_per;
	uint32_t burst_size;

	if ((NULL == puart_adapter) || (NULL == pgdma_chnl)) {
		DBG_UART_ERR("hal_uart_rx_gdma_init: puart_adapter=0x%x pgdma_chnl=0x%x\n", puart_adapter, pgdma_chnl);
		return HAL_ERR_PARA;
	}

	if (puart_adapter->rx_dma_burst_size == 0) {
		// didn't assign the TX DMA burst size
		// use rx FIFO trigger level to set the DMA burst size
		switch (puart_adapter->base_addr->stsr_b.rxfifo_trigger_level_status) {
		case UartRxFifoLev_1byte:
			burst_size = 4;
			break;

		case UartRxFifoLev_8bytes:
			burst_size = 8;
			break;

		case UartRxFifoLev_16bytes:
			burst_size = 16;
			break;

		case UartRxFifoLev_28bytes:
			burst_size = 28;
			break;
		}
		puart_adapter->rx_dma_burst_size = (uint8_t)burst_size;
	}
	// how many bytes in RX FIFO will trigger DMA to read RX FIFO
	puart_adapter->base_addr->miscr_b.rxdma_burstsize = puart_adapter->rx_dma_burst_size;
	puart_adapter->base_addr->fcr_b.dma_mode = 1;
	puart_adapter->base_addr->miscr_b.rxdma_en = 0; // disable RX DMA at initial

	if (puart_adapter->uart_idx > Uart4) {
		DBG_UART_ERR("hal_uart_rx_gdma_init: Invalid UART Idx(%u), didn't initial? \r\n", puart_adapter->uart_idx);
		return HAL_ERR_PARA;
	}
	src_per = uart_rx_gdma_hsk_id_tbl[puart_adapter->uart_idx];

	pgdma_chnl->gdma_ctl.tt_fc = TTFCPeriToMem;
	//pgdma_chnl->gdma_cfg.reload_src = 1;
	pgdma_chnl->gdma_cfg.src_per = (u8)src_per;
	pgdma_chnl->ch_sar = (u32) & (puart_adapter->base_addr->rbr);
	pgdma_chnl->gdma_isr_type = (TransferType | ErrType);
	pgdma_chnl->gdma_ctl.int_en = 1;
	pgdma_chnl->gdma_ctl.dinc = IncType;
	pgdma_chnl->gdma_ctl.sinc = NoChange;
	pgdma_chnl->have_chnl = 0;

	hal_rtl_gdma_handshake_init(pgdma_chnl, (uint8_t)src_per);
	hal_rtl_gdma_irq_reg(pgdma_chnl, (irq_handler_t)_uart_rx_dma_irq_handler, puart_adapter);
	puart_adapter->prx_gdma = pgdma_chnl;

	return HAL_OK;
}

/**
 *  @brief To de-initial the UART RX GDMA channel.
 *         Also will disable the UART RX DMA transfer mode.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *
 *  @return     HAL_ERR_PARA:  Input arguments are invalid.
 *  @return     HAL_OK:  GDMA channel de-initialization OK.
 */
SECTION_UART_TEXT
hal_status_t hal_rtl_uart_rx_gdma_deinit(phal_uart_adapter_t puart_adapter)
{
	if (NULL == puart_adapter) {
		DBG_UART_ERR("hal_uart_rx_gdma_deinit: puart_adapter = NULL\n");
		return HAL_ERR_PARA;
	}

	if (NULL == puart_adapter->prx_gdma) {
		DBG_UART_ERR("hal_uart_rx_gdma_deinit: rx_gdma = NULL\n");
		return HAL_ERR_PARA;
	}

	puart_adapter->prx_gdma = NULL;
	puart_adapter->base_addr->miscr_b.rxdma_en = 0; // disable RX DMA

	return HAL_OK;
}


/**
 *  @brief Disable the given UART port. It will do:
 *           - disable UART hardware function.
 *           - disable UART GDMA channel.
 *           - disable UART pins.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *
 *  @returns void
 */
SECTION_UART_TEXT
void hal_rtl_uart_deinit(phal_uart_adapter_t puart_adapter)
{
	uint32_t i;

	if ((puart_adapter->is_inited == 0) ||
		(puart_adapter->uart_idx >= MaxUartNum)) {
		return;
	}

	// Wait all TX data transfered
	for (i = 0; i < 100; i++) {
		if (puart_adapter->base_addr->lsr_b.txfifo_empty) {
			break;
		} else {
			hal_delay_us(100);
		}
	}

	// Disable Interrupt
	puart_adapter->base_addr->ier = 0x00;
	puart_adapter->base_addr->vier = 0x00;
	puart_adapter->base_addr->visr = 0xFF;  // clear all pending status
	hal_rtl_uart_unreg_irq(puart_adapter);

	if (puart_adapter->ptx_gdma != NULL) {
		hal_rtl_uart_tx_gdma_deinit(puart_adapter);
	}

	if (puart_adapter->prx_gdma != NULL) {
		hal_rtl_uart_rx_gdma_deinit(puart_adapter);
	}

#if !defined(CONFIG_BUILD_NONSECURE)
	hal_rtl_uart_en_ctrl(puart_adapter->uart_idx, OFF);
#else
	if (NULL != puart_adapter->hal_sys_peripheral_en_cb) {
		puart_adapter->hal_sys_peripheral_en_cb(puart_adapter->uart_idx, OFF);
	} else {
		DBG_UART_ERR("UART%d: enable ctrl fail! fun_ptr == NULL\r\n", puart_adapter->uart_idx);
		//return HAL_ERR_PARA;
	}
#endif

