swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
	puart_adapter->is_inited = 0;
}

/**
 *  @brief Controls the RTS signal.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  rts_ctrl  The RTS signal control value.
 *                        - 1: the RTS signal will go low(notify peer can start to send data).
 *                        - 0: the RTS signal will go high(notify peer stop data sending).
 *
 *  @returns    void.
 */
SECTION_UART_TEXT
void hal_rtl_uart_set_rts(phal_uart_adapter_t puart_adapter, BOOLEAN rts_ctrl)
{
	UART_Type *puart;

	puart = puart_adapter->base_addr;
	if (rts_ctrl) {
		// write rts bit 1 -> the RTS signal will go low -> notify peer can start to send data
		puart->mcr_b.rts = 1;
	} else {
		// write rts bit 0 -> the RTS signal will go high -> notify peer stop data sending
		puart->mcr_b.rts = 0;
	}
}

/**
 *  @brief To pause/resume the TX by control the internal CTS.
 *         It can be used to implement the software flow control(XOn/XOff).
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  cts_ctrl The internal CTS signal control value.
 *                         - 1: the TX will be paused just like the external CTS goes high.
 *                         - 0: the TX will be resumed just like the externel CTS goes low.
 *
 *  @returns    void.
 */
SECTION_UART_TEXT
void hal_rtl_uart_tx_pause(phal_uart_adapter_t puart_adapter, BOOLEAN cts_ctrl)
{
	puart_adapter->base_addr->mcr_b.sw_cts = (cts_ctrl == 0) ? 0 : 1;
}

/**
 *  @brief Initials a UART adapter contents by a given UART port configuration structure.
 *
 *  @param[in]  puart_adapter The UART adapter to be initialed.
 *  @param[in]  uart_idx  The UART index. The value can be 0 ~ 2.
 *  @param[in]  pconfig  The UART adapter configuration to be used to initial this UART adapter.
 *                       If this value is NULL, a default configuration will be applied for
 *                       the initialization.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_adapter_init(phal_uart_adapter_t puart_adapter, uint8_t uart_idx, phal_uart_defconfig_t pconfig)
{
	if (NULL == puart_adapter) {
		return;
	}

	_memset((void *)puart_adapter, 0, sizeof(hal_uart_adapter_t));

	switch (uart_idx) {
	case Uart0:
		puart_adapter->base_addr = (UART_Type *)UART0_REG_BASE;
		break;

	case Uart1:
		puart_adapter->base_addr = (UART_Type *)UART1_REG_BASE;
		break;

	case Uart2:
		puart_adapter->base_addr = (UART_Type *)UART2_REG_BASE;
		break;

	case Uart3:
		puart_adapter->base_addr = (UART_Type *)UART3_REG_BASE;
		break;

	case Uart4:
		puart_adapter->base_addr = (UART_Type *)UART4_REG_BASE;   //BTUART
		break;

	default:
		return;
	}

	puart_adapter->uart_idx = uart_idx;

	if (pconfig == NULL) {
		if (uart_idx == Uart0) {
			pconfig = (phal_uart_defconfig_t) &hal_uart_default_setting_40m;
			puart_adapter->uart_sclk = UartSCLK_40M;
		} else {
			//UART1/2/3/4 default SCLK= 50MHz
			pconfig = (phal_uart_defconfig_t) &hal_uart_default_setting_50m;
			puart_adapter->uart_sclk = UartSCLK_50M;
		}
	}

	puart_adapter->baudrate = pconfig->baudrate;
	puart_adapter->flow_ctrl = pconfig->flow_ctrl;
	puart_adapter->parity_type = pconfig->parity_type;
	puart_adapter->stop_bit = pconfig->stop_bit;
	puart_adapter->word_len = pconfig->word_len;

	puart_adapter->pdef_baudrate_tbl = pconfig->pdef_baudrate_tbl;
	puart_adapter->pdef_ovsr_tbl = pconfig->pdef_ovsr_tbl;
	puart_adapter->pdef_div_tbl = pconfig->pdef_div_tbl;
	puart_adapter->pdef_ovsradjbit_tbl10 = pconfig->pdef_ovsradjbit_tbl10;
	puart_adapter->pdef_ovsradjbit_tbl9 = pconfig->pdef_ovsradjbit_tbl9;
	puart_adapter->pdef_ovsradjbit_tbl8 = pconfig->pdef_ovsradjbit_tbl8;
	puart_adapter->pdef_ovsradj_tbl10 = pconfig->pdef_ovsradj_tbl10;
	puart_adapter->pdef_ovsradj_tbl9 = pconfig->pdef_ovsradj_tbl9;
	puart_adapter->pdef_ovsradj_tbl8 = pconfig->pdef_ovsradj_tbl8;

	_puart_adapter[uart_idx] = puart_adapter;

}

/**
 *  @brief Hooks a callback function for the UART line status error interrupt.
 *         This function will enable the line status error interrupt.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  pcallback  The callback function.
 *  @param[in]  pdata  The argument of the callback function. It is an application
 *                     priviate data to be passed by this callback function.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_line_sts_hook(phal_uart_adapter_t puart_adapter, uart_lsr_callback_t pcallback, void *pdata)
{
	puart_adapter->lsr_callback = pcallback;
	puart_adapter->lsr_cb_para = pdata;

	// enable line status interrupt
	puart_adapter->base_addr->ier_b.elsi = 1;
}

/**
 *  @brief Hooks a callback function for data TX done interrupt.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  pcallback  The callback function.
 *  @param[in]  id  The argument of the callback function. It is an application
 *                    priviate data to be passed by this callback function.
 *  @param[in]  event  The argument of the callback function. It is an application
 *                    priviate data to be passed by this callback function.
 *
 *  @returns void
 */
SECTION_UART_TEXT
void hal_rtl_uart_txtd_hook(phal_uart_adapter_t puart_adapter, uart_irq_callback_t pcallback,
							uint32_t id, uint32_t event)
{
	puart_adapter->tx_td_callback = pcallback;
	puart_adapter->tx_td_cb_id = id;
	puart_adapter->tx_td_cb_ev = event;

	// enable/disable TX SFR empty interrupt
	if (pcallback != NULL) {
		puart_adapter->base_addr->ier_b.etbei = 1;
	} else {
		if ((puart_adapter->state & (HAL_UART_STATE_TX_BUSY | HAL_UART_STATE_DMATX_BUSY)) == 0) {
			puart_adapter->base_addr->ier_b.etbei = 0;
		}
	}
}

/**
 *  @brief Hooks a callback function for RX data ready interrupt.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  pcallback  The callback function.
 *  @param[in]  id  The argument of the callback function. It is an application
 *                    priviate data to be passed by this callback function.
 *  @param[in]  event  The argument of the callback function. It is an application
 *                    priviate data to be passed by this callback function.
 *
 *
 *  @returns void
 */
SECTION_UART_TEXT
void hal_rtl_uart_rxind_hook(phal_uart_adapter_t puart_adapter, uart_irq_callback_t pcallback,
							 uint32_t id, uint32_t event)
{
	puart_adapter->rx_dr_callback = pcallback;
	puart_adapter->rx_dr_cb_id = id;
	puart_adapter->rx_dr_cb_ev = event;

	// enable RX data ready interrupt
	if (pcallback != NULL) {
		puart_adapter->base_addr->ier_b.erbi = 1;
	} else {
		if ((puart_adapter->state & (HAL_UART_STATE_RX_BUSY)) == 0) {
			puart_adapter->base_addr->ier_b.erbi = 0;
		}
	}
}

/**
 *  @brief Hooks a callback function for interrupt mode or DMA mode
 *         data transmission finished event.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  pcallback  The callback function.
 *  @param[in]  parg  The argument of the callback function. It is an application
 *                    priviate data to be passed by this callback function.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_txdone_hook(phal_uart_adapter_t puart_adapter, uart_callback_t pcallback, void *parg)
{
	puart_adapter->tx_done_callback = pcallback;
	puart_adapter->tx_done_cb_para = parg;
}

/**
 *  @brief Hooks a callback function for interrupt mode or DMA mode
 *         data receiving finished event.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  pcallback  The callback function.
 *  @param[in]  parg  The argument of the callback function. It is an application
 *                    priviate data to be passed by this callback function.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_rxdone_hook(phal_uart_adapter_t puart_adapter, uart_callback_t pcallback, void *parg)
{
	puart_adapter->rx_done_callback = pcallback;
	puart_adapter->rx_done_cb_para = parg;
}

/**
 *  @brief Setups and enable the UART RX match filter.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  pattern  The match pattern.
 *                       - [7:0]: byte0.
 *                       - [15:8]: byte1.
 *  @param[in]  mask  The mask of the match pattern.
 *  @param[in]  mask_en The mask enable control.
 *                      value = 0   mask is disabled.
 *                      value > 0   mask is enabled.
 *
 *  @returns void
 */
SECTION_UART_TEXT
void hal_rtl_uart_set_rx_filter_pattern(phal_uart_adapter_t puart_adapter, uint32_t pattern,
										uint32_t mask, uint32_t mask_en)
{
	UART_Type *puart = puart_adapter->base_addr;

	puart->rfmpr_b.rf_mp1 = (uint8_t)(pattern & 0xFF);
	puart->rfmpr_b.rf_mp2 = (uint8_t)((pattern >> 8) & 0xFF);
	puart->rfmvr_b.rf_mv1 = (uint8_t)(mask & 0xFF);
	puart->rfmvr_b.rf_mv2 = (uint8_t)((mask >> 8) & 0xFF);
	puart->rfcr_b.rf_mask_en = (mask_en != 0) ? 1 : 0;
}

/**
 *  @brief Configures the UART RX match filter option.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  pattern_len  The match pattern length:
 *                             - 1: 1 byte.
 *                             - 2: 2 bytes.
 *  @param[in]  match_op  The match filter operation mode
 *                          - 0: AND.
 *                          - 1: OR.
 *                          - 2: XOR.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_set_rx_filter_op(phal_uart_adapter_t puart_adapter, uint32_t pattern_len, uint32_t match_op)
{
	UART_Type *puart = puart_adapter->base_addr;

