swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
	puart->rfcr_b.rf_len = (pattern_len == 1) ? UartRxFilter1Byte : UartRxFilter2Bytes;
	puart->rfcr_b.rf_cmp_op = match_op & 0x03;
}

/**
 *  @brief Configures the UART RX match filter timeout value.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  timeout_ms  The period to wait next incoming RX byte, unit is mini-second.
 *  @param[in]  callback  The callback function to handle the timeout event of RX filter wait next byte.
 *  @param[in]  cb_arg  The argument of the RX filter timeout callback function. It is an application
 *                      priviate data to be passed by this callback function.
 *
 *  @returns void
 */
SECTION_UART_TEXT
void hal_rtl_uart_set_rx_filter_timeout(phal_uart_adapter_t puart_adapter, uint32_t timeout_ms,
										uart_callback_t callback, void *cb_arg)
{
	uint64_t ticks;

	ticks = (uint64_t)puart_adapter->baudrate * (uint64_t)timeout_ms / 1000;
	if (ticks > 0xFFFFF) {
		ticks = 0xFFFFF;
	} else if (ticks < 12) {
		ticks = 12;
	}
	puart_adapter->base_addr->rftor_b.rf_timeout = ticks;

	puart_adapter->rx_flt_timeout_callback = callback;
	puart_adapter->rx_flt_timeout_cb_arg = cb_arg;
	if (callback) {
		puart_adapter->base_addr->vier_b.rf_idle_timeout_int_en = 1;
	} else {
		puart_adapter->base_addr->vier_b.rf_idle_timeout_int_en = 0;
	}
}

/**
 *  @brief Enables the UART RX match filter. The RX filter should be configured
 *         before enable it. The software need to re-enable the RX filter for every
 *         RX data matching. The hardware will disable this RX filter on a matched event hit.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  callback  The callback function to handle the RX filter matched event.
 *  @param[in]  cb_arg  The argument of the RX filter matched callback function.
 *                      It is an application priviate data to be passed by this callback function.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_rx_filter_en(phal_uart_adapter_t puart_adapter, uart_callback_t callback, void *cb_arg)
{
	if (callback) {
		puart_adapter->rx_flt_matched_callback = callback;
		puart_adapter->rx_flt_matched_cb_arg = cb_arg;
		puart_adapter->base_addr->rfcr_b.rf_en = 1;
		puart_adapter->base_addr->vier_b.rf_patt_match_int_en = 1;   // enable RX filter matched interrupt
	} else {
		DBG_UART_ERR("hal_uart_rx_filter_en: Callback is NULL\r\n");
	}
}

/**
 *  @brief Disables the UART RX match filter.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_rx_filter_dis(phal_uart_adapter_t puart_adapter)
{
	puart_adapter->base_addr->rfcr_b.rf_en = 0;
	puart_adapter->base_addr->vier_b.rf_patt_match_int_en = 0;   // disable RX filter matched interrupt
}

/**
 *  @brief Resets the UART receiver hardware state machine.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_reset_receiver(phal_uart_adapter_t puart_adapter)
{
	puart_adapter->base_addr->stsr_b.reset_rcv = 1;
	__NOP();
	__NOP();
	puart_adapter->base_addr->stsr_b.reset_rcv = 0;
}

/**
 *  @brief Setups the TX FIFO low level. The TX FIFO low interrupt will be triggered
 *         when the the data count in the TX FIFO is lower than the low level.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  low_level  The low level selection:
 *                           - value 0: 4 bytes.
 *                           - value 1: 8 bytes.
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_set_tx_fifo_level(phal_uart_adapter_t puart_adapter, uint32_t low_level)
{
	if (low_level <= 4) {
		puart_adapter->base_addr->fcr_b.txfifo_low_level = UartTxFifoLow_4bytes;
	} else {
		puart_adapter->base_addr->fcr_b.txfifo_low_level = UartTxFifoLow_8bytes;
	}
}

/**
 *  @brief Configures the RX FIFO high level. The RX FIFO high interrupt will be triggered
 *         when the the data count in the RX FIFO is higher than the configured level.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  level  The high level selection:
 *                     - 0: 1 byte.
 *                     - 1: 8 bytes.
 *                     - 2: 16 bytes.
 *                     - 3: 28 bytes.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_set_rx_fifo_level(phal_uart_adapter_t puart_adapter, uint32_t level)
{
	if (level >= 28) {
		puart_adapter->base_addr->fcr_b.rxfifo_trigger_level = UartRxFifoLev_28bytes;
	} else if (level >= 16) {
		puart_adapter->base_addr->fcr_b.rxfifo_trigger_level = UartRxFifoLev_16bytes;
	} else if (level >= 8) {
		puart_adapter->base_addr->fcr_b.rxfifo_trigger_level = UartRxFifoLev_8bytes;
	} else {
		puart_adapter->base_addr->fcr_b.rxfifo_trigger_level = UartRxFifoLev_1byte;
	}
}

/**
 *  @brief Enables the RX Idle timeout function. The RX idle timer will be start/re-start on
 *         every new byte receiving. If there is no new data be received in the given period
 *         the callback function will be called.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  timeout_us  The timeout period, in micro-second.
 *  @param[in]  pcallback  The call back function.
 *  @param[in]  parg  The argument for the callback function. It is an application priviate
 *                    data to be passed by this callback function.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_rx_idle_timeout_en(phal_uart_adapter_t puart_adapter, uint32_t timeout_us,
									 uart_callback_t pcallback, void *parg)
{
	uint32_t bit_time;
	uint32_t byte_time;
	uint32_t frame_bits;
	uint32_t timeout_bytes;
	uint32_t timeout_bytes_2pwr;

	if ((puart_adapter == NULL) || (pcallback == NULL)) {
		DBG_UART_ERR("hal_uart_rx_idle_timeout_en: puart_adapter=0x%x, pcallback=0x%x\r\n", puart_adapter, pcallback);
		return;
	}

	bit_time = 1000000000 / puart_adapter->baudrate + 1; // bit time in ns
	frame_bits = puart_adapter->word_len + 1; // 1 start bit + data bits
	if (puart_adapter->parity_type != UartParityNone) {
		frame_bits++;   // 1 parity bit
	}
	byte_time = bit_time * frame_bits;
	// convert byte_time to uint us
	if ((byte_time % 1000) > 500) {
		byte_time = byte_time / 1000 + 1;
	} else {
		byte_time = byte_time / 1000;
	}
	timeout_bytes = timeout_us / byte_time;
	if (timeout_bytes == 0) {
		timeout_bytes = 1;
	}

