swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_uart.c
	// timeout bytes = 2**bits_field
	timeout_bytes_2pwr = 0;
	while (timeout_bytes > 1) {
		timeout_bytes = timeout_bytes >> 1;
		timeout_bytes_2pwr++;
	}

	if (timeout_bytes_2pwr > 15) {
		timeout_bytes_2pwr = 15;
	}

	// hook call-back
	puart_adapter->rx_idle_timeout_callback = pcallback;
	puart_adapter->rx_idle_timeout_cb_arg = parg;
	// Enable RX timeout interrupt
	puart_adapter->base_addr->visr_b.rx_idle_timeout_int_sts = 1;   // clear interrrupt pending status first
	puart_adapter->base_addr->vier_b.rx_idle_timeout_int_en = 1;   // enable RX idle timeout interrupt
	// configure RX idle timeout register
	puart_adapter->base_addr->ritor_b.rxidle_timeout_value = timeout_bytes_2pwr;
	puart_adapter->base_addr->ritor_b.rx_idle_timeout_en = 1;   // enable RX idle timeout function
}

/**
 *  @brief Disables the RX idle timeout function.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_rx_idle_timeout_dis(phal_uart_adapter_t puart_adapter)
{
	if (puart_adapter == NULL) {
		DBG_UART_ERR("hal_uart_rx_idle_timeout_dis: puart_adapter = NULL\r\n");
		return;
	}

	// disable RX idle timeout function
	puart_adapter->base_addr->ritor_b.rx_idle_timeout_en = 0;   // disable RX idle timeout function

	// Disable RX timeout interrupt
	puart_adapter->base_addr->visr_b.rx_idle_timeout_int_sts = 1;   // clear interrrupt pending status first
	puart_adapter->base_addr->vier_b.rx_idle_timeout_int_en = 0;   // disable RX idle timeout interrupt

	// clear call-back
	puart_adapter->rx_idle_timeout_callback = NULL;
	puart_adapter->rx_idle_timeout_cb_arg = NULL;
}

/**
 *  @brief Hooks a callback function for interrupt mode TX FIFO level low event.
 *
 *  @param[in]  puart_adapter  The UART adapter.
 *  @param[in]  pcallback  The callback function.
 *  @param[in]  parg  The argument of the callback function. It is an application
 *                    priviate data to be passed by this callback function.
 *
 *  @returns    void
 */
SECTION_UART_TEXT
void hal_rtl_uart_tx_fifo_low_hook(phal_uart_adapter_t puart_adapter, uart_callback_t pcallback,
								   void *parg)
{
	puart_adapter->tx_fifo_low_callback = pcallback;
	puart_adapter->tx_fifo_low_cb_para = parg;
}
#endif // end of "#if CONFIG_UART_EN"
